Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/agent.service.app.po
Languages: fr

source: A symlink to mylauncher marking the script for schedule upon service start
fr: Un lien symbolique vers mylauncher marquant le script pour exécution lors des démarrages de service

source: A symlink to mylauncher marking the script for schedule upon service status
fr: Un lien symbolique vers mylauncher marquant le script pour exécution lors des évalutions d'état du service

source: A symlink to mylauncher marking the script for schedule upon service stop
fr: Un lien symbolique vers mylauncher marquant le script pour exécution lors des arrêts de service

source: Application can be started and stopped without touching the other service resources with::
fr: Les applications peuvent être démarrées et arrêtées sans impacter les autres services par ::

source: Application launchers
fr: Lanceurs applicatifs

source: Application launchers are installed in the directory pointed by ``/opt/opensvc/etc/svcnamed.d``. They follow the SysV guidelines:
fr: Les lanceurs applicatifs sont installés dans le répertoire pointé par ``/opt/opensvc/etc/svcnamed.d``. Ils respectent les directives SysV :

source: Common launchers
fr: Lanceurs usuels

source: Crontab handler
fr: Gestionnaire de tâches planifiées

source: Example::
fr: Exemple ::

source: File name
fr: Nom de fichier

source: In containers and virtual machines OpenSVC the launchers are installed in ``/svc/etc/init.d/`` in the container file tree.
fr: Dans les containers et les machines virtuelles gérés par OpenSVC, les lanceurs sont installés dans ``/svc/etc/init.d/`` dans l'arborescence du container.

source: Note that an additional safety net is needed to keep the cron jobs from failing after a node unclean reboot: all cron jobs must verify the presence of their executable file.
fr: A noter qu'un garde fou supplémentaire est requis pour éviter que les exécutions de tâches planifiées renvoient des erreurs à la suite d'un redémarrage du noeud en court-circuit des stopeurs : toutes les tâches planifiées doivent vérifier la présence de leur exécutable.

source: Services often come with specific schedules. Either they start their own private scheduler, or they use the main system scheduler. In the later case, services' cron jobs must be installed upon service start and removed upon service stop to make sure the jobs don't get scheduled on multiple nodes. The following launcher script can be used to do that on hosts with split crontab support. It installs and removes the crontabs in ``/opt/opensvc/etc/myservice.d/cron.d/``::
fr: Les services nécessitent souvent des planifications spécifiques de tâches. Soit ils peuvent démarrer leur propre planificateur, soit ils doivent partager le planificateur du système hôte. Dans ce dernier cas, les planifications du service doivent être installées au démarrage du service, et retirées à l'arrêt pour garantir que les tâches ne seront pas exécutées sur plusieurs noeud du cluster. Le lanceur suivant peut être utilisé à cette fin sur des noeuds dont le planificateur crond supporte les fichiers de configurations morcelés. Il installe et retire les configurations disponibles dans ``/opt/opensvc/etc/myservice.d/cron.d/`` ::

source: The ``OPENSVC_SVCNAME`` variable is set by OpenSVC to the service name, so that integrators can write reusable launcher scripts. Examples of this variable usage below.
fr: La variable ``OPENSVC_SVCNAME`` est positionnée par OpenSVC et prend pour valeur le nom du service, afin de permettre aux intégrateurs d'écrire des lanceurs réutilisables. Des exemples d'utilisation de cette variable sont visibles ci-après.

source: The launcher script proper
fr: Le script de lancement

source: Usage
fr: Utilisation
