Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/agent.install.po
Languages: fr

source: /etc/lvm/lvm_{node}.conf
fr: /etc/lvm/lvm_{noeud}.conf

source: 2am-6am sundays
fr: 02:00-06:00 les dimanches

source: 4am-6am daily
fr: 04:00-06:00 tous les jours

source: A reference ``node.conf`` file can be found on the node at ``<OSVCROOT>/usr/share/doc/node.conf``.
fr: Un fichier de référence ``node.conf`` peut être trouvé sur le noeud à l'emplacement ``<OSVCROOT>/usr/share/doc/node.conf``.

source: A typical schedule definition would look like::
fr: Une définition typique de planification ressemblerait à ::

source: Add the following root-level configuration node::
fr: Ajoutez la configuration de noeud suivante ::

source: All actions except data syncs can be statistically delayed. The probability of running increases linearly from 25% to 100% during the first half of the action allowed period. This delay helps level to collector load.
fr: Toutes les actions exceptées les synchronisations de données peuvent êtrestatistiquement retardées. La probabilité d'exécution augmente de 25% à 100% sur la durée de la première moitié de l'intervalle autorisé d'exécution de l'action. Ce retard aide à niveler la charge du collecteur.

source: And add the ``local`` tag to all local volume groups. For example::
fr: Et ajoutez le tag ``local`` à tous les volume groups locaux. Par exemple ::

source: By default, the collector is contacted by the node using the generic name ``dbopensvc`` on ports ``80`` and ``8000``. This name should be known to your prefered resolving mecanism : hosts, dns, ... If you choose to use the internet shared collector, the corresponding ip address must be set to the address of ``collector.opensvc.com``.
fr: Par défaut, le collecteur est contacté par le noeud en utilisant le nom générique ``dbopensvc`` sur les ports ``80`` et ``8000``. Ce nom doit pouvoir être résolu par le mécanisme de résolution en place : hosts, dns, ... Si vous utilisez le collecteur internet, l'ip correspondante doit être celle de ``collector.opensvc.com``.

source: Configuration for collector usage
fr: Configuration pour l'utilisation d'un collecteur

source: Create this file, {node} being the output of uname -n and add the following configuration::
fr: Créez ce fichier, {noeud} étant la sortie de ``uname -n`` et ajoutez la configuration suivante ::

source: Cron jobs
fr: Tâches planifiées

source: Default
fr: Défauts

source: Download the lastest OpenSVC package available for your operating system of choice from http://repo.opensvc.com and install it. Depending on the operating system, and operating system version, you might need to satisfy dependencies using packages provided on this website.
fr: Téléchargez la dernière version du paquet OpenSVC disponible pour le système d'exploitation de votre choix à l'adresse http://repo.opensvc.com et installez-le. En fonction du système d'exploitation, vous pouvez être amené à satisfaire des dépendences en utilisant les paquets proposés sur ce site internet.

source: Files
fr: Fichiers

source: Finally you need to rebuild the initrd/initramfs to prevent shared vg activation at boot.
fr: Pour finir, vous devez reconstruire l'environnement initrd/initramfs afin d'empêcher l'activation des vg partagés au boot.

source: Finally, you can accelerate the node discovery by forcing the execution of opensvc cron jobs after the package installation::
fr: Enfin, vous pouvez accélérer la découverte du noeud en forçant l'exécution des tâches planifiée OpenSVC après l'installation du paquet ::

source: HP-UX specificities
fr: Spécificités HP-UX

source: Keys
fr: Clés

source: Linux LVM2 specificities
fr: Spécificités LVM2 sur Linux

source: Linux and HP-UX also have a helper to gather statistics::
fr: Linux et HP-UX ont également une tâche de collecte de statistiques ::

source: Microsoft fcinfo for Fibre Channel SAN reporting
fr: fcinfo de Microsoft pour les inventaires de SAN Fibre Channel

source: No
fr: Oui

source: None
fr: Aucune

source: On Unix systems, if the root account has no ssh key, a 1024 bits dsa key is generated by the package post-install. Production node keys must be trusted on all cluster nodes (PRD and DRP), whereas the keys of disaster recovery servers must not be trusted by production nodes. This setup is used for rsync file transfers and remote command execution.
fr: Sur les systèmes Unix, si le compte root n'a pas de clé ssh, une clé dsa de 1024 bits est générée par la post-installation du paquet. Les clés des noeuds de production doivent être autorisées sur tous les noeuds du cluster (PRD et DRP), alors que les clés des noeuds de reprise sur sinistre ne doivent pas être autorisées sur les noeuds de production. Cette configuration est utilisée pour les synchronisations de données par rsync et pour les exécutions de commandes à distance.

source: On Windows, OpenSVC installs a dedicated service to schedule these tasks.
fr: Sur Windows, OpenSVC installe un service dédié à la planification de ces tâches.

source: Only PRD nodes are allowed to push data to a PRD node
fr: Seuls les noeuds de PRD sont autorisés à envoyer des données à un noeud de PRD

source: Only PRD services are allowed to start on a PRD node
fr: Seuls les services de PRD sont autorisés à démarrer un noeud de PRD

source: OpenSVC agent installation
fr: Installation de l'agent OpenSVC

source: OpenSVC controls volume group activation and desactivation. Most Linux distributions activate all visible volume groups at boot, some even re-activate them upon de-activation events. These mecanisms can be disabled using the following setup. It also provides another protection against unwanted volume group activation from a secondary cluster node.
fr: OpenSVC contrôle l'activation et la désactivation des volume groups. La plupart des distributions Linux activent tous les volume groups visibles au boot, certaines vont même jusqu'à les réactiver après désactivation manuelle. Ces mécanismes peuvent être débrayés en déployant les configurations suivantes. Ces configurations apportent également une protection supplémentaire contre les activations non voulues sur les noeuds secondaires du cluster.

source: Package
fr: Paquet

source: Python win32 library
fr: Librairie Python win32

source: Schedules are defined in ``<OSVCROOT>/etc/node.conf``. The OpenSVC agent schedules the following actions:
fr: Les planifications des tâches sont définies dans ``<OSVCROOT>/etc/node.conf``. L'agent OpenSVC planifie les actions suivantes :

source: Section name
fr: Nom de la section

source: Send to the collector the collected node information (cpu, memory, board, ...)
fr: Envoi au collecteur des informations collectées sur le noeud (processeur, mémoire, matériel, ...)

source: Send to the collector the collected performance metrics since last pushstats
fr: Envoi au collecteur des échantillons de performance rassemblés depuis le dernier pushstats

source: Send to the collector the compliance modules checks results
fr: Envoi au collecteur des résultats des sondes de conformité

source: Send to the collector the node checks results (fs_u, fs_i, vg_u, ...)
fr: Envoi au collecteur des sondes du noeud (fs_u, fs_i, vg_u, ...)

source: Send to the collector the node installed package database
fr: Envoi au collecteur de la base de paquets installés

source: Send to the collector the node installed patch database
fr: Envoi au collecteur de la base de correctifs installés

source: Send to the collector the service configurations
fr: Envoi au collecteur des configurations de services

source: Set host mode
fr: Paramétrage du mode de noeud

source: Set schedules
fr: Paramétrage des planifications

source: Statistic Delay
fr: Retards statistiques

source: The HP-UX base system does not provide tools to handle scsi persistent reservations. You have to install the scu tool if you want to activate this feature.
fr: La base installée standard de HP-UX ne permet pas de gérer les reservations persistentes SCSI. Il faut donc installer l'outil additionnel scu si vous souhaitez activer cette fonctionnalité.

source: The OpenSVC agent on Windows depends on:
fr: L'agent OpenSVC sur Windows dépend de :

source: The ``<OSVCROOT>/etc/.node.conf`` must not be edited by hand. It contains a cache of the computed schedules of all individual services' sync resources. As a cache, it is maintained by OpenSVC, and manual changes to this file would be overwritten.
fr: Le fichier ``<OSVCROOT>/etc/.node.conf`` ne doit pas être édité manuellement. Il contient un cache des planifications calculé en fonction de toutes les ressources de synchronisation de tous les services du noeud. En tant que cache, il est maintenu par OpenSVC, et tout changement manuel dans ce fichier serait écrasé.

source: The agent is installed in ``/opt/opensvc/`` on Unix and in ``%%ProgramFiles%%\opensvc\`` on Windows. This directory is referred to as ``<OSVCROOT>`` in this documentation.
fr: L'agent est installé dans ``/opt/opensvc/`` sur Unix et dans ``%%ProgramFiles%%\opensvc\`` sur Windows. Ce répertoire est référencé comme ``<OSVCROOT>`` dans cette documentation.

source: The collector requires the nodes to provide an authentication token (shared secret) with each request. The token is forged by the collector and stored on the node in ``node.conf``. The token initialization is handled by the command::
fr: Le collecteur exige d'un noeud qu'il fournisse avec chaque requête un jeton d'identification (secret partagé). Ce jeton est généré par le collecteur et stocké sur le noeud dans le fichier ``node.conf``. La génération initiale du jeton est déclenchée par la commande ::

source: The host_mode setting is used to enforce the following policies:
fr: Le paramètre host_mode est utilisé dans les politiques suivantes :

source: The package installs the following cron jobs, in (by order of preference), ``/etc/cron.d/opensvc``, ``/var/spool/cron/crontabs/root``, ``/var/spool/cron/root``::
fr: Le paquet installe les tâches planifiées suivantes dans, par ordre de préférence, ``/etc/cron.d/opensvc``, ``/var/spool/cron/crontabs/root``, ``/var/spool/cron/root`` ::

source: The package installs the following directory tree::
fr: Le paquet installe l'arborescence suivante ::

source: The package post-installation steps are handled by the ``<OSVCROOT>/bin/postinstall`` script. This script can be safely executed on a node where OpenSVC is already installed.
fr: La post-installation du paquet est prise en charge par le script ``<OSVCROOT>/bin/postinstall``. Ce script peut être exécuté en toute sécurité sur un noeud où OpenSVC est déjà installé.

source: The python package provided by HP will output garbage on exec because it won't find terminfo at the expected places. To fix that, you have to export ``TERMINFO=/usr/share/lib/terminfo`` from ``/etc/profile``
fr: Le paquet python fournit par HP renvoie des informations indésirables lors de son exécution à cause de son incapacité à trouver terminfo aux emplacements attendus. Pour corriger cela, il vous faut exporter ``TERMINFO=/usr/share/lib/terminfo`` depuis ``/etc/profile``

source: The syncservices action schedule is defined by the individual sync resource definitions in service configuration files, where ``sync_interval``, ``sync_days`` and ``sync_period`` parameters are available.
fr: La tâche planifiée syncservices est déduite depuis les définitions de ressource sync dans les configurations de services, dans lesquelles les paramètres ``sync_interval``, ``sync_days`` et ``sync_period`` sont disponibles.

source: The valid host mode values are PRD, DEV, TST. The setting is stored in ``<OSVCROOT>/etc/node.conf``. On a fresh install this file does not exist. Note that the ``<OSVCROOT>/var/host_mode`` file is deprecated. Upgrading the new OpenSVC package on a system with a ``<OSVCROOT>/var/host_mode`` file will move the value to ``<OSVCROOT>/etc/node.conf``.
fr: Les valeurs possibles de host_mode sont PRD, DEV, TST. Ce paramètre est stocké dans ``<OSVCROOT>/etc/node.conf``. Sur une installation vierge, ce fichier n'existe pas. A noter que le fichier ``<OSVCROOT>/var/host_mode`` est déprécié. La mise à jour vers une version d'OpenSVC plus récente déplacera le paramètre host_mode vers ``<OSVCROOT>/etc/node.conf``.

source: This override is recommended for xmlrpc encryption.
fr: Ce surchargement est recommandé pour activer l'encryption des xmlrpc.

source: This setup tells LVM2 commands to activate only the objects tagged with the hostname. Opensvc makes sure the tags are set on start and unset on stop. Opensvc also purges all tags before adding the one it needs to activate a volume group, so opensvc can satisfy a start request on a service uncleanly shut down.
fr: Cette configuration indique aux commandes LVM2 de n'activer que les objets taggés avec le nom d'hôte. OpenSVC s'assure que les tags sont correctement positionnés au démarrage, et retirés à l'arrêt. OpenSVC purge également tous les tags avant d'ajouter celui du noeud nécessaire pour l'activation d'un volume group, afin d'assurer un démarrage correct d'un service qui n'a pas été arrêté proprement.

source: To disable collector communications, use::
fr: Pour désactiver les communications avec le collecteur, utilisez ::

source: To override the default collector's xmlrpc urls, you can set them in node.conf::
fr: Pour surcharger les définitions par défaut des urls xmlrpc du collecteur, vous pouvez les paramétrer dans node.conf ::

source: Try a ``syncall`` action on all node's services
fr: Déclencher l'action ``syncall`` sur tous les services du noeud

source: Upgrade
fr: Mise à jour

source: Upgrading the OpenSVC msi package manually requires msiexec options::
fr: La mise à jour manuelle du paquet msi de OpenSVC nécessite les options suivantes ::

source: Windows specificities
fr: Spécificités Windows

source: Yes
fr: Oui
