Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/agent.service.management.po
Languages: fr

source: Acquire scsi persistent reservations on disks of the service (wrapped by startvg and startdisk)
fr: Aquiert les reservations persistantes scsi sur les disques du service (également déclenché par startvg et startdisk)

source: All action logs are multiplexed to:
fr: Tous les journaux d'action sont multiplexés dans :

source: Apply action to all node services having the node as an 'autostart_node' in their env file.
fr: Appliquer l'action à tous les services dont le noeud est défini en tant que 'autostart_node' dans leur fichier env.

source: Apply action to all node services in 'down' state.
fr: Appliquer l'action à tous les services du noeud en état 'down'.

source: Apply action to all node services in 'up' and 'warn' state.
fr: Appliquer l'action à tous les services du noeud en état 'up' ou 'warn'.

source: Apply action to all node services. The command ``/opt/opensvc/bin/allservices shutdown --parallel`` is triggered upon node shutdown by the opensvc rc script. The command ``/opt/opensvc/bin/allservices boot --parallel`` is triggered upon node startup by the opensvc rc script.
fr: Appliquer l'action à tous les services du noeud. La commande ``/opt/opensvc/bin/allservices shutdown --parallel`` est déclenchée lors de la séquence d'arrêt du noeud par le lanceur OpenSVC. La commande ``/opt/opensvc/bin/allservices boot --parallel`` est déclenchée lors du démarrage du noeud par le lanceur OpenSVC.

source: Commands
fr: Commandes

source: Contextual group of services management
fr: Gestion d'un groupe de services par état

source: Detailled service resources status.
fr: Etats détaillé par ressource d'un service.

source: Examples
fr: Exemples

source: Explicit group of services management
fr: Gestion d'un groupe de services par pointage

source: Explicit service management
fr: Gestion d'un service

source: Logging
fr: Journalisation

source: OpenSVC provides a set of svcmgr links applying preset filters on local service.
fr: OpenSVC inclue un jeu de lien symboliques vers la commande svcmgr qui appliquent des filtres prédéfinis sur les services présents.

source: Overview of all local node services status.
fr: Enumération des états possibles d'un service sur un noeud.

source: Print resource status of a service::
fr: Afficher les états de chaque ressource d'un service ::

source: Print services status of a node::
fr: Afficher l'état général des services sur le noeud ::

source: Print status of all service resources
fr: Afficher l'état de chaque ressource du service

source: Release scsi persistent reservations on disks of the service (wrapped by stopvg and stopdisk)
fr: Relâche les réservations persistantes scsi sur les disks du service (également déclenché par stopvg et stopdisk)

source: Service management
fr: Gestion des services

source: Services status
fr: Etats des services

source: Start of an HP-VM service::
fr: Démarrage d'un service HP-VM ::

source: Start of an Xen service::
fr: Démarrage d'un service Xen ::

source: Start resources of type disk group
fr: Démarre les ressources de type disk group

source: Start resources of type fs and the underlying resources
fr: Démarre les ressources de type fs et les ressources dépendantes

source: Start resources of type ip
fr: Démarre les ressources de type ip

source: Start resources of type ip, loop, disk group, zpool, fs, container, app
fr: Démarre les ressources de type ip, loop, disk group, zpool, fs, container, app

source: Start resources of type loop
fr: Démarre les ressources de type loop

source: Start resources of type loop, disk group, zpool, fs
fr: Démarre les ressources de type loop, disk group, zpool, fs

source: Stop of a hosted Oracle service::
fr: Arrêt d'un service Oracle en mode hosted ::

source: Stop resources of type app, container, fs, zpool, disk group, loop, ip
fr: Arrête les ressources de type app, container, fs, zpool, disk group, loop, ip

source: Stop resources of type disk group
fr: Arrête les ressources de type disk group

source: Stop resources of type fs and the underlying resources
fr: Arrête les ressources de type fs et les ressources dépendantes

source: Stop resources of type fs, zpool, disk group, loop
fr: Arrête les ressources de type fs, zpool, disk group, loop

source: Stop resources of type ip
fr: Arrête les ressources de type ip

source: Stop resources of type loop
fr: Arrête les ressources de type loop

source: The prefered command to use to start an action on a specific group of services is ``/opt/opensvc/bin/svcmgr --service svc1,svc2 action``.
fr: La commande à privilégier pour démarrer une action sur un groupe de services est ``/opt/opensvc/bin/svcmgr --service svc1,svc2 action``.

source: The prefered command to use to start an action on a specific service is ``/opt/opensvc/etc/svcname action``.
fr: La commande à privilégier pour démarrer une action sur un service particulier est ``/opt/opensvc/etc/svcname action``.

source: Trigger hard-coded and user-defined file synchronization to disaster recovery nodes. Optionally creates snapshots to send a coherent file set. No-op if run from a node not running the service.
fr: Déclenche les synchronisations codées en dur des fichiers du système vers les noeud de reprise sur sinistre. Eventuellement crée les snapshots pour envoyer un jeu de fichiers cohérents. Sans effet sur les noeud où le service n'est pas actif.

source: Trigger hard-coded and user-defined file synchronization to secondary nodes. Optionally creates snapshots to send a coherent file set. No-op if run from a node not running the service.
fr: Déclenche les synchronisations codées en dur et celles définies par l'utilisateur vers les noeuds secondaires du service. Eventuellement crée les snapshots pour envoyer un jeu de fichiers cohérents. Sans effet sur les noeud où le service n'est pas actif.

source: ``/opt/opensvc/log/<svcname>.log`` Daily rotation on these files, and size limit rotation
fr: ``/opt/opensvc/log/<svcname>.log`` Rotation quotidienne sur ces journaux, et rotation sur taille limite

source: collector database Optional, through asynchronous xmlrpc calls.
fr: Base de données du collecteur, via xmlrpc asynchrones.

source: stdout
fr: sortie standard
