Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/agent.items.po
Languages: fr

source: Cron jobs
fr: Tâches planifiées

source: Embedded documentation. Most importantly the service configuration reference file documenting all possible parameters.
fr: Documentation embarquée. Notamment le fichier de configuration de service de référence contenant tous les paramètres supportés.

source: Executables like svcmon, svcmgr
fr: Fichiers exécutables, dont svcmon et svcmgr

source: Executables to create package and optional, site-specific, release scripts (none shipped in the opensvc-provided packages)
fr: Fichiers exécutables dédiés à la création des paquets, et, éventuellement, les scripts d'intégration aux dépots (aucun n'est livré dans les paquets fournis par OpenSVC).

source: File tree
fr: Arborescence des fichiers

source: Hosts service configurations
fr: Configurations des services

source: Hosts the (daily by default) cron job responsible for the service configurations gathering/pushing to collector, and for the rsync data synchronization to remote nodes. Note that even if no syncs are explicitely described in service configurations, there are still rsyncs scheduled for service and node configuration replication between nodes of a cluster.
fr: Héberge le script de la tâche planifiée (quotidienne par défaut) responsable de l'émission au collecteur des configurations de service et des synchronisations de données vers les autres noeuds. A noter que même si aucune synchronisation n'est explicitement déclarée dans les configurations de service, il existe néanmoins des synchronizations par rsync planifiées pour repliquer les configurations de service entre les noeuds d'un cluster.

source: Installed items details
fr: Détail des éléments installés

source: Libraries implementing the nodeware logics
fr: Librairies implémentant la logique de l'agent

source: Operating system specific performance metrics gathering. Extends what the operating system provides by default, for example ``sar`` on Linux, FreeBSD and Solaris, ``glance`` on HP-UX.
fr: Scripts de collecte de performance spécifiques aux systèmes d'exploitation. Etendent ce que ces systèmes d'exploitation proposent par défaut, par exemple via ``sar`` sous Linux, FreeBSD et Solaris, ``glance`` sur HP-UX.

source: Per-service, local, size-rotated, delay-rotated log files. All logs are also multiplexed to stdout and to the collector via xmlrpc
fr: Fichiers de journaux locaux par service, en rotation sur taille limite. Tous les journaux sont également multiplexés sur la sortie standard et sur le collecteur via xmlrpc.

source: Pushes the service and node configuration to the collector via xmlrpc, and triggers internal and user-configured rsyncs. Customized frequencies are preserved upon package upgrades.
fr: Emet les configurations de service et de noeud au collecteur via xmlrpc, et déclenche les synchronisations de données internes et configurées par les utilisateurs. Les personnalisations de fréquence sont préservées lors des mises à jour de l'agent.

source: Pushes the service per-resource status to the collector via xmlrpc
fr: Emet les états individuels de resource au collecteur via xmlrpc

source: Temporary, discardable files
fr: Fichiers temporaires et effaçables

source: Where executables create the lock-files used to ensure two actions can not run simultaneously on the same service.
fr: Où les exécutables créent leurs fichiers-verrous utilisés pour garantir que deux actions ne sont pas exécutées simultanéement sur le même service.

source: Where the production nodes of a cluster back up their configuration. These backups are used in case of disaster recovery activation to restore some specific configurations of the production nodes.
fr: Où les noeuds de production d'un cluster archivent leurs configurations. Ces archives sont utilisées en cas d'activation d'un plan de reprise sur sinistre pour restaurer des configurations spécifiques aux noeuds de production.
