Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/agent.service.creation.po
Languages: fr

source: Allocate generic account and ip addresses
fr: Attribuer un compte générique et une adresse internet

source: App launchers in etc/init.d/
fr: Lanceurs applicatifs dans etc/init.d/

source: Application data files
fr: Données de l'application

source: At that point you should describe your service's ip addresses, filesystems, disk groups, file synchronizations ... The ``/opt/opensvc/usr/share/doc/template.env`` template presents you with all possible configurations available. The ``svcmgr create -s newsvc -i`` command prompts you about all possible configurations, explains the role of each keyword, proposes candidate values and defaults, and validate input sanity. This same command in non-interactive mode can be used to provision service. In this mode, the resources are passed as json-serialized keyword-value dictionaries.
fr: A ce point, vous devez décrire les adresses internet, les systèmes de fichiers, les groupes de disques, les synchronisations, ... de votre service. Le fichier-modèle ``/opt/opensvc/usr/share/doc/template.env`` illustre toutes les configurations possibles. La commande ``svcmgr create -s newsvc -i`` propose interactivement toutes ces configurations explique le rôle de chaque mot-clé, propose des valeurs par défaut, et valide la cohérence les valeurs saisies. Cette même commande en mode non-interactif peut être utilisée pour provisionner des services. Dans ce mode, les définitions de ressources sont passées sous forme de dictionnaires sérialisés au format JSON.

source: Between 8 to 15 characters
fr: Entre 8 et 15 caractères

source: Choose a service name
fr: Choisir un nom de service

source: Configuration files role
fr: Rôle des fichiers de configuration

source: Create a filesystem skeleton for the service
fr: Créer un squelette d'arborescence pour le service

source: Create configuration files
fr: Créer les fichiers de configuration

source: Customize the service env file
fr: Personnaliser le fichier env du service

source: Following this naming will help grasp importance, clients and role of service from the output of ``/opt/opensvc/bin/svcmon``
fr: Suivre cette nomenclature de service aide à percevoir l'importance, les utilisateurs et le rôle du service directement dans la sortie de la commande ``/opt/opensvc/bin/svcmon``

source: For hosted service mode, prefer per-service private tools installations to enhance system/service insulation. This makes the service installation more painful, but there are no clients at this point, and it will make service relocation more reliable and operating system upgrades safer.
fr: Pour les services en mode hosted, préférer l'installation privée des outils pour améliorer l'isolation du service par rapport au system hôte. Ce choix rend l'intégration du service plus pénible mais à ce point le service n'est pas encore utilisé et il rend les bascules plus fiables et les mises à jour du système hôte moins impactantes.

source: Give each service dedicated filesystems. Ideally one for data, one for tools (mysql, apache, ...) and one for launchers and eventually the virtual operating system instance. We recommand the following layout:
fr: Donner à chaque service des systèmes de fichiers dédiés. Idéalement un pour les données, un pour les outils (mysql, apache, ...) et un pour les lanceurs et éventuellement l'instance de système d'exploitation du container. Nous recommandons l'organisation suivante :

source: Guidelines:
fr: Lignes directrices :

source: Here is a set of guidelines you should respect.
fr: Suit un jeu de lignes directrices qu'il serait bon de respecter.

source: In case of multiple instance of similar services, happen a number as a suffix
fr: Dans le cas où plusieurs instance du même service cohabitent, suffixer d'un incrément numérique

source: Install virtual host and applications
fr: Installer le container et les applications

source: Make application code part of the name (first)
fr: Intégrer le code applicatif dans le nom (première position)

source: Make service type (PRD, DEV) part of the name (second)
fr: Intégrer le type de service (PRD, DEV) dans le nom (deuxième position)

source: Make the last part descriptive of the application role (web, transco)
fr: Intégrer dans la dernière partie du nom une description fonctionnelle du service (web, transco, ...)

source: Perceptible latency and memory overhead. Host system must rely on tcp/ip communication with the virtual machine to control its resources (change ip addresses, start service applications, ...)
fr: Impact sur les latences et la mémoire perceptible. Le système hôte dépend des communications tcp/ip pour piloter les ressources de la machine virtuelle (démarrage des applications, ...).

source: Prefered mode where it is supported : quite low-latency, low mem and cpu overhead, good control of virtual system from the host system.
fr: Mode privilégié quand supporté : faible impact sur les latences, la mémoire et le cpu, bon contrôle du système containerisé depuis l'hôte.

source: Private installation of tools. Tools must listen only on the private address to avoid conflicts with same tool of other services running on the same node.
fr: Installation privée des outils. Les outils doivent écouter sur l'adresse privée du service pour éviter les conflicts entre instances du même outil mais de services différents tournant sur le même noeud.

source: Select a service mode
fr: Choisir un mode de service

source: Service configuration files are in ``/opt/opensvc/etc``. Each service must have these three files present to be fully functional. Services using the internet shared collector must be named using the domainname as a suffix to avoid naming conflicts::
fr: Les fichiers de configuration d'un service sont dans ``/opt/opensvc/etc``. Chaque service doit avoir trois fichiers présents pour être complètement fonctionnel. Les services utilisant le collecteur internet doivent être nommés en définissant le nom de domaine en temps que suffixe du nom de service pour éviter les conflits de nommage entre des services de clients différents ::

source: Service creation
fr: Création d'un service

source: The virtual host is not required for ``hosted`` services.
fr: Cette étape n'est pas nécessaire pour les services en mode ``hosted``.

source: This guidelines result in names like gieprdtransco01, infraprddns01, ...
fr: Ces lignes directrices produisent des noms de service tels que gieprdtransco01, infraprddns01, ...

source: This is the configuration file proper, including service description and resource definitions. A fully commented template is available on each node at /opt/opensvc/usr/share/doc/template.env. More on this below.
fr: C'est le principal fichier de configuration. Il contient la description du service et de ses ressources. Un modèle complètement commenté est disponible sur chaque noeud dans ``/opt/opensvc/usr/share/doc/template.env``. Plus détails ci-bas.

source: This optional directory can be used to store locally the startup scripts. As such, it can be linked from /opt/opensvc/etc/unxdevweb01.mydomain.com.d. OpenSVC synchronize this directory to nodes and drpnodes as part of the sync#i0 internal sync resource. If you placed your startup script on a shared volume, this .dir is not needed but you will still have to create a sync resource to send them to the drpnodes.
fr: Ce répertoire optionel peut être utilisé pour stocker localement les lanceurs applicatifs. En tant que tel, il peut être pointé par le lien /opt/opensvc/etc/unxdevweb01.mydomain.com.d. OpenSVC synchronise ce répertoire avec les noeuds secondaires et les noeuds de reprise sur sinistre dans le cadre de la ressource interne de synchronisation sync#i0. Si les lanceurs sont placés dans un volume partagé, ce répertoire .dir n'est pas nécessaire, et il vous incombe de définir une synchronisation pour répliquer les lanceurs vers le site de reprise sur sinistre.

source: This symbolic link is meant to be used as a shortcut to pass commands to a specific service. Like /opt/opensvc/etc/unxdevweb01.mydomain.com start for example
fr: Ce lien symbolique sert de racourci pour passer des commandes au service. Par exemple, /opt/opensvc/etc/unxdevweb01.mydomain.com start.

source: This symbolic link points to the directory hosting the service application launchers. The service is not considered active if this link is not present. The directory pointed is best hosted on a service-dedicated filesystem. The service application launchers are expected to be in SysV style: [SK][0-9]*appname. S for starters, K for stoppers, number for ordering. Starters and stoppers can be symlink to a single script. Starter are passed 'start' as first parameter, stoppers are passed 'stop' as first parameter.
fr: Ce lien symbolique pointe le répertoire qui contient les lanceurs applicatifs. Le service n'est pas utilisable tant que ce lien n'existe pas. Le répertoire pointé devrait, quand c'est possible, être contenu par un système de fichier dédié au service. Les lanceurs sont au format SysV : [SK][0-9]*appname. S pour les lanceurs, K pour les stopeurs, le nombre pour l'ordonnancement. Les lanceurs et les stopeurs peuvent être des liens symboliques vers le même script. Les lanceurs se voient passer le paramètre 'start' et les stopeurs 'stop'.

source: Those are created automatically by the ``svcmgr create`` command. Experienced users will find it easier to start from a copy of the env file of an existing similar service. The following information describes the steps needed to create a service manually.
fr: Ceux-là sont créés automatiquement par la commande ``svcmgr create``. Les utilisateurs expérimentés trouveront plus simple de créer un service par copie du fichier de configuration d'un service similaire. Les étapes suivantes décrivent la création manuelle d'un service.

source: We recommend to allocate service-dedicated generic accounts (one is ok most of the time), at least for ``hosted`` services, for better control on privileges. All service files should be owned by these accounts except the application launchers, which must be owned by root as they are executed with root privileges. The generic account home directory should be a link redirecting to a subdirectory of one of the service-dedicated filesystems (the one hosting data is a good candidate).
fr: Nous recommandons d'allouer au service un compte utilisateur générique (un seul est suffisant dans la plupart des cas), pour les services en mode ``hosted``, pour mieux contrôler les privilèges. Tous les fichiers d'un service devraient appartenir à ce compte, exception faite des lanceurs qui doivent appartenir à root, puisqu'exécutés avec les privilèges de root. Le homdir de ce compte générique devrait être un lien pointant vers un sous-répertoire d'un des systèmes de fichiers dédiés au service (celui hébergeant les données est un bon candidat).

source: We recommend to allocate service-dedicated ip addresses, to permit service failover to secondary nodes.
fr: Nous recommandons d'allouer à chaque service une adresse internet privée pour permettre la bascule des services entre noeuds.

source: Where virtualisation is unwanted : low-latency applications, restrictive product compatibility matrices, ...
fr: Où la virtualisation est indésirable : applications basse-latence, applications dont la matrice de compatibilité ne supporte pas la virtualisation.

source: You should now be able to run succesfully::
fr: Vous devriez désormais pouvoir lancer la commande suivante ::

source: or::
fr: ou ::
