Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/agent.update.po
Languages: fr

source: A mirror can be set up using::
fr: Un miroir peut être initialisé par ::

source: After the mirror initialization, you have to update the current links according to your own policies. Beware, the mirroring step may have installed current links pointing to the lastest available agent packages.
fr: Après l'initialisation du miroir, il reste à mettre à jour les liens current selon votre politique. Attention, l'étape de miroir peut avoir installé des liens current pointant sur les dernières versions disponibles de l'agent OpenSVC.

source: Download the required opensvc package to your hosts and use operating system specific local package management commands.
fr: Téléchargez le paquet OpenSVC correspondant à vos serveurs et utilisez les commandes de gestion de paquet spécifique au système d'exploitation.

source: Example::
fr: Exemple ::

source: Feed the opensvc packages into your existing per operating system package depots and use operating system specific network-aware package management commands.
fr: Alimentez vos dépots spécifiques à vos systèmes d'exploitation avec les paquets OpenSVC et utilisez les commandes d'installation de paquet à distance de vos systèmes.

source: Initialize the mirror
fr: Initialisation d'un miroir

source: Mirror http://repo.opensvc.com on a corporate server and set up the opensvc agent to use this mirror as a package source.
fr: Créez un miroir de http://repo.opensvc.com sur un serveur de l'entreprise et paramétrez les agents OpenSVC pour qu'ils utilisent ce miroir comme source de paquets.

source: OpenSVC agent updates
fr: Mises à jour de l'agent OpenSVC

source: OpenSVC provides packages for all supported operating systems at http://repo.opensvc.com. Agents can be updated using one of the following methods, ordered by scalability:
fr: OpenSVC met à disposition des paquets pour tous les systèmes d'exploitation supportés sur http://repo.opensvc.com. Les agents peuvent être mis à jour par les méthodes suivantes, par ordre d'adéquation à un volume de serveurs croissant :

source: Set up the agents
fr: Paramétrage des agents

source: Set up the published versions
fr: Paramétrage des versions publiées

source: The OpenSVC agent downloads the file pointed by the link named ``current`` under the package category supported by the operating system running the agent. For example a Solaris host executing 'nodemgr updatepkg' would try to download pkg/current.
fr: L'agent OpenSVC télécharge le fichier pointé par le lien nommé ``current`` dans le répertoire portant le nom du système de paquetage supporté par le système d'exploitation exécutant l'agent. Par exemple, un serveur Solaris exécutant la commande 'nodemgr updatepkg' téléchargerait pkg/current.

source: The repository must be known to the agent. This set up is done with either the node.repo or the node.repopkg ``node.conf`` parameters.
fr: Le dépot doit être connu de l'agent. Cette configuration se fait par le paramètre node.repo ou node.repopkg du fichier ``node.conf``.

source: The resulting file tree must organized as::
fr: L'arborescence de fichiers résultante doit être organisée comme suit ::

source: The update command is::
fr: La commande de mise à jour est ::

source: This chapter describes the last method.
fr: Ce chapitre décrit cette dernière méthode.

source: This command is operating system agnostic.
fr: Cette commande est agnostique au système d'exploitation.

source: This parameter allows to set up a URI pointing to a pure OpenSVC agent packages repository. If specified node.repopkg overrides node.repo.
fr: Ce paramètre permet de définir une URI pointant sur une arborescence de paquets OpenSVC respectant l'organisation maître. Si défini, le paramètre node.repopkg prend le pas sur node.repo.

source: This parameter allows to set up a URI pointing to a repository hosting both compliance gzipped tarballs in the compliance/ subdirectory and OpenSVC agent packages in the packages/ subdirectory.
fr: Ce paramètre permet de définir une URI pointant sur une arborescence hébergeant à la fois une archive de type tarball gzippée dans le sous-répertoire compliance/ et les paquets de l'agent OpenSVC dans le sous-répertoire packages.

source: Updating the agent
fr: Mise à jour de l'agent
