Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/collector.admin.obsolescence.po
Languages: fr

source: **Missing obsolescence information**
fr: **Information sur l'obsolescence manquante**

source: **Nodes above obsolescence thresholds**
fr: **Noeuds au delà du seuil d'obsolescence**

source: Alerts and warnings generate different alerts in the dashboard.
fr: Les alertes et avertissements donnent lieu à des entrées dans le tableau de bord.

source: Dashboard alerts
fr: Alertes du tableau de bord

source: Obsolescence management
fr: Gestion de l'obsolescence

source: Obsolescence setup
fr: Configuration de l'obsolescence

source: Operating systems and hardware are collected from the asset database.
fr: Les systèmes d'exploitation et les matériels sont glanés depuis la base des assets.

source: Operating systems and hardware generate different alerts in the dashboard.
fr: LLes systèmes d'exploitation et les matériels donnent lieu à des entrées différenciées dans le tableau de bord.

source: The 'Warn date' and 'Alert date' thresholds can be set by clicking on the table cell.
fr: Les seuils 'date d'avertissement' et 'date d'alerte' peuvent être modifiés en clickant sur la cellule du tableau.

source: The collector helps plan operating systems and hardware upgrades through constant notification of items beyond user-defined warning and alerting thresholds.
fr: Le collecteur aide à planifier les mises à jour des systèmes d'exploitation et des matériels par ses notifications au jour le jour des éléments ayant dépassé les seuils d'avertissement et d'alerte définis par l'utilisateur.

source: The count of nodes matching each different os and hardware type is displayed in the 'count' column. Clicking on the count number displays the list of nodes.
fr: Un compteur du nombre de serveurs correspondant à chaque différent système d'exploitation et matériel est affiché dans la colonne 'compte'. Cliquer sur une de ces valeurs affiche la liste des serveurs correspondants.

source: These notifications are displayed only to users with the 'Manager' role. They show how many operating system and hardware type items have no warn and alert date set by the managers.
fr: Ces notifications sont affichées uniquement aux utilisateurs gratifiés du rôle 'Manager'. Elles montrent quels systèmes d'exploitation et quels matériels n'ont pas de date d'avertissement ou de date d'alerte paramétrées.

source: This view is accessed through the :menuselection:`Admin --> Obsolescence Setup` menu.
fr: Cette vue est accédée par le menu :menuselection:`Admin --> Obsolescence`.
