Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/collector.view.services.po
Languages: fr

source: **Container type**
fr: **Type de container**

source: **Generate diagrams of clusters to better communicate on disaster recovery plans and allocated resources**
fr: **Génère des diagrammes des clusters pour aider à la communication lors de la préparation des plans de reprise d'activité et pour la compréhension des ressources allouées à un service.

source: **List services matching criteria**
fr: **Lister les services qui correspondent à certains critères**

source: **Prefered node**
fr: **Noeud primaire**

source: **Provision a new service from a template**
fr: **Provisionner un nouveau service depuis un modèle**

source: **Quick insight of live service status**
fr: **Analyse rapide des états des services**

source: **Responsible**
fr: **Responsable**

source: **Service type**
fr: **Type de service**

source: **Status**
fr: **Etat**

source: **Trigger actions on a node or a group of nodes**
fr: **Déclencher des actions sur un seul ou un groupe de noeuds**

source: **Trigger actions on a service or a group of services**
fr: **Déclencher des actions sur un seul ou un groupe de services**

source: An all-greyed-out status marker indicates the presented data is too old to be trusted, though it displays the last overall known status. Hovering the mouse over the status markers will displayed the data refresh timestamp.
fr: Un état composite complètement grisé indique que les données présentées sont trop agées pour être considérées sans suspicion. Les données présentées sont les dernières reçues. Le survol du curseur au dessus des états fait apparaître l'horodatage des données.

source: Check some rows and click :menuselection:`Node action`
fr: Cocher des lignes et cliquer sur :menuselection:`Action de noeud`

source: Check some rows and click :menuselection:`Service action`
fr: Cocher des lignes et cliquer sur :menuselection:`Action de service`

source: Check some rows and click :menuselection:`Topology`
fr: Cocher des lignes et cliquer sur :menuselection:`Topologie`

source: Click :menuselection:`Provisioning`
fr: Cliquer sur :menuselection:`Provisioning`

source: Color
fr: Couleur

source: Dashboard notifications
fr: Notifications dans le tableau de bord

source: Development service. Services of this type are not allowed to be started on production nodes.
fr: Service de développement. Les services de ce type ne sont pas autorisés à démarrer sur les noeuds de production.

source: Example: 'How many non-production services do I manage for the ERP system' ``app=ERP & type=!PRD``
fr: Exemple : 'Combien de service hors-production de l'application ERP sont sous ma responsabilité' ``app=ERP & type=!PRD``

source: Example: 'I lost a power line, which services are impacted': ``nb_power_supply=1 & power_supply_1=POW_A``
fr: Exemple : 'Une ligne d'alimentation électrique est perdue, combien de services sont impactés' : ``nb_power_supply=1 & power_supply_1=POW_A``

source: Fields
fr: Champs

source: Frozen services
fr: Services gelés

source: Node actions
fr: Actions de noeud

source: Production service. Services of this type can be started on any type of node.
fr: Service de production. Les services de ce type peuvent être démarrés sur n'importe quel type de noeud.

source: Screenshot
fr: Copies d'écran

source: Service actions
fr: Actions de service

source: Service status not updated
fr: Etats de service non mis à jour

source: Services not up
fr: Services non démarrés

source: Services view
fr: Vue des services

source: Status gizmos present the overall service health on top, and individual resource type status below. Color codes are:
fr: Des composites d'états présentent l'état global du service en haut, et des états aggrégé par type de ressource en bas. Le code des couleur est :

source: Temporary service. Like DEV, but alerts won't be sent for these services.
fr: Service temporaire. Comme pour DEV, mais les alertes ne sont pas générées pour ces services.

source: The application code is a way to group services dedicated/paid by some corporate entity or project. You can setup any application code you want in your services configuration file, using the app parameter.
fr: Le code applicatif est un moyen de grouper les servicés dédiés ou financés par une même entité de l'entreprise ou un projet. Vous pouvez choisir le code applicatif dans le fichier de configuration des services, en utilisant le paramètre app.

source: The container type reflect the service integration type of the service. This setting is set in the service configuration file on the nodes as the ``mode`` parameter. The possible values are:
fr: Le type de container indique le type d'intégration du service. Ce paramètre est défini dans le fichier de configuration des services par le paramètre ``mode``. Les valeurs possibles sont :

source: The responsibles are persons receiving alerts for a service. Hovering the mouse over the icon spawns the name of the responsibles. No icon means no responsible, which is an anomaly, and as such, cause alerts to be emitted to the site's administrator/manager.
fr: Les responsables sont les individus qui recoivent les alertes d'un service. Le survol du pointeur au dessus de l'icône fait apparaître un encart contenant le nom des responsables. L'absence d'icône indique que le service n'a pas de responsable identifié, ce qui est une anomalie, et en tant quel telle, provoque l'envoi d'alertes au 'Manager' du site.

source: The service applications and data are deployed in a HP-UX native virtual machine. The ip is plumbed on a virtual interface, with virtualized mac address. Filesystem resources are mounted in the virtual host.
fr: Les applications et les données du service sont déployées dans une machine virtuelle HP-UX. L'adresse internet est montée sur une interface virtuelle, avec adresse physique virtuelle. Les systèmes de fichiers sont montés dans la machine virtuelle.

source: The service applications and data are deployed in a KVM virtual machine. The ip is plumbed on a virtual interface, with virtualized mac address. Filesystem resources are mounted in the virtual host.
fr: Les applications et les données sont déployées dans une machine virtuelle de type KVM. L'adresse internet est montée sur une interface virtuelle, avec adresse physique virtuelle. Les systèmes de fichiers sont montés dans la machine virtuelle.

source: The service applications and data are deployed in a Linux Container (zone-like). The ip is plumbed on a virtual interface, with virtualized mac address or tunneled. Filesystem resources are mounted in the host system.
fr: Les applications et les données sont déployées dans un container Linux (équivallent des zones). L'adresse internet est montée sur une interface virtuelle, avec adresse physique virtuelle, ou tunnelée. Les systèmes de fichiers sont montés dans le système hôte.

source: The service applications and data are deployed in a Linux Container (zone-like). The ip is plumbed on a virtual interface, with virtualized mac address. Filesystem resources are mounted in the host system.
fr: Les applications et les données sont déployées dans un container Linux (équivallent des zones). L'adresse internet est montée sur une interface virtuelle, avec adresse physique virtuelle, ou tunnelée. Les systèmes de fichiers sont montés dans le système hôte.

source: The service applications and data are deployed in a Oracle Virtual Machine. The ip is plumbed on a virtual interface, with virtualized mac address. Filesystem resources are mounted in the virtual host.
fr: Les applications et les données sont déployées dans une machine virtuelle de type Oracle VM. L'adresse internet est montée sur une interface virtuelle, avec adresse physique virtuelle. Les systèmes de fichiers sont montés dans la machine virtuelle.

source: The service applications and data are deployed in a Solaris zone. The ip is still plumbed in the global zone. Filesystem resources are mounted in the global zone.
fr: Les applications et les données sont déployées dans un container Solaris. L'adresse internet est montée dans la zone globale. Les systèmes de fichiers sont montés dans le système hôte.

source: The service applications and data are deployed in a VirtualBox virtual machine. The ip is plumbed on a virtual interface, with virtualized mac address. Filesystem resources are mounted in the virtual host.
fr: Les applications et les données sont déployées dans une machine virtuelle de type Oracle VirtualBox. L'adresse internet est montée sur une interface virtuelle, avec adresse physique virtuelle. Les systèmes de fichiers sont montés dans la machine virtuelle.

source: The service applications and data are deployed in a Xen virtual machine. The ip is plumbed on a virtual interface, with virtualized mac address. Filesystem resources are mounted in the virtual host.
fr: Les applications et les données sont déployées dans une machine virtuelle de type Xen. L'adresse internet est montée sur une interface virtuelle, avec adresse physique virtuelle. Les systèmes de fichiers sont montés dans la machine virtuelle.

source: The service is hosted on bare metal, non-virtualized resources : ip plumbed on a physical interface, applications and data in filesystems mounted on a real server.
fr: Le service est hébergé sur le système hôte. Les ressources sont non-virtualisées : l'adresse internet est montée sur une interface physique, les applications et les données sont dans des systèmes de fichiers montés sur le système physique.

source: This property is used by the nodeware to sanity check actions asked by the admin.
fr: Cette propriété est utilisée par l'agent pour vérifier la cohérence des actions demandées par l'utilisateur.

source: This view presents service inventory and health.
fr: Cette vue présente l'inventaire des service et leur santé.

source: Tools
fr: Outils

source: Topology
fr: Topologie

source: Typical use cases:
fr: Cas d'usage usuels :

source: Upon node reboot, only the services whose prefered node is set to this node are started. During those services start-up, the nodeware verifies the service is not running on another node and aborts the start-up if so.
fr: Lors d'un redémmarage de noeud, seuls les services dont le noeud préféré (preferred_node) est paramétré à ce même noeud sont démarrés. Durant le démarrage de ces services, l'agent vérifie que le service ne tourne pas déjà sur un autre noeud. Auquel cas il annule son démarrage.

source: Usage
fr: Utilisation

source: green
fr: vert

source: grey
fr: gris

source: red
fr: rouge

source: resource has warnings
fr: la ressource est en attention

source: resource is down
fr: la ressource est à l'arrêt

source: resource is up
fr: la ressource est démarrée

source: resource type is not used by the service
fr: le type de ressource n'est pas utilisé par le service

source: |video-icon| `Watch a video <http://www.youtube.com/watch?feature=player_embedded&v=Yh7P7F61DB0>`_
fr: |video-icon| `Regarder une vidéo <http://www.youtube.com/watch?feature=player_embedded&v=Yh7P7F61DB0>`_
