Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/collector.view.packages.po
Languages: fr

source: Compare installed version of packages across a set of nodes
fr: Comparaison des versions de paquet installés sur un groupe de noeuds

source: Dashboard notifications
fr: Notifications dans le tableau de bord

source: Identify nodes vulnerable to bug or security problems known to certain package versions
fr: Identification des noeuds vulnérables à un bug ou à une faille de sécurité liée à un paquet particulier

source: Identify nodes where a package is installed or not installed
fr: Identification des noeuds où un paquet est installé mais indésirable

source: Package differences amongst nodes of a cluster
fr: Différences de paquets installés sur les noeuds d'un cluster

source: Packages database entries not refreshed for more than 24 hours will have its update date highlighted red. Information for such a package should not be trusted.
fr: Les entrées de la base des paquets non rafraîchies pendant 24 heures ont leur horadatage affiché en rouge. Ces informations sont à considérer avec suspicion.

source: Packages view
fr: Vue des paquets

source: Plan upgrades
fr: Planification des mises à jour

source: Screenshot
fr: Copies d'écran

source: The OpenSVC agent pushes installed package list from the nodes to the collector. Centralized package lists allow administrators to easily:
fr: L'agent OpenSVC envoit au collecteur les bases de paquets installés de chaque noeud. La centralisation de ces informations facilite pour les administrateurs :

source: The toolbox of the nodes view proposes a tool to highlight package differences between selected nodes.
fr: La boite à outils de la vue des noeuds inclut un outil pour mettre en lumière les différences de paquets installés entre les noeuds sélectionnés.

source: Usage
fr: Utilisation
