Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/collector.view.nodes.po
Languages: fr

source: Add node
fr: Ajouter un noeud

source: Dashboard notifications
fr: Notifications dans le tableau de bord

source: Delete node
fr: Supprimer un noeud

source: Group performance
fr: Performance de groupe

source: Installed packages comparison
fr: Comparaison des paquets installés

source: Node actions
fr: Actions de noeud

source: Nodes close to warranty end
fr: Noeuds proches de leur fin de garantie

source: Nodes view
fr: Vue des noeuds

source: Nodes without asset information
fr: Noeuds sans information d'asset

source: Screenshot
fr: Copies d'écran

source: This view presents nodes information. Part of which is collected from the nodes themselves, through the OpenSVC agent. Information like geo-location, team responsible, power lines connexions, role, warranty end and status are either manually set or imported from the corporate asset manager.
fr: Cette vue présente les informations sur les noeuds. Une partie de ces information sont glanées depuis les noeuds eux-même, par l'agent OpenSVC. L'autre partie, dont la géolocalisation, les équipes responsables, les lignes d'alimentations électriques, le rôle, la date de fin de garantie et l'état dans le cycle de vie du noeud est soit configurée par saisie manuelle, soit importée depuis le gestionnaire de biens de l'entreprise.

source: Tools
fr: Outils

source: Usage
fr: Utilisation

source: |video-icon| `Watch a video <http://www.youtube.com/watch?feature=player_embedded&v=9L4xfn9ylmI>`_
fr: |video-icon| `Regarder une vidéo <http://www.youtube.com/watch?feature=player_embedded&v=9L4xfn9ylmI>`_
