Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/collector.view.checks.po
Languages: fr

source: A check without value update for more than 24 hours will have its update date highlighted red. These checks instances should not be trusted.
fr: Une sonde dont la valeur n'a pas été mise à jour pendant 24 heures aura son horadatage affiché en rouge. Ces valeurs de sonde sont à considérer avec suspicion.

source: Check types have default high and low threshold values. These values can be customized for each node and instance of the check or a threshold can be attached to a filterset.
fr: Les familles de sondes ont des valeur par défaut pour les seuils haut et bas. Ces valeurs peuvent être changées pour chaque instance de chaque sonde, ou des seuils peuvent être attachées à un jeu de filtres.

source: Check value not updated
fr: Valeur de sonde non mise à jour

source: Check value out of bounds
fr: Valeur de sonde en dehors des seuils

source: Checks view
fr: Vue des sondes

source: Clicking a checker name opens a dialog to change the default value.
fr: Cliquer un nom de sonde ouvre un encart qui permet de changer les valeurs de seuil par défaut.

source: Dashboard notifications
fr: Notifications dans le tableau de bord

source: Each check is validated against high and low threshold values. If the current check value is outside boundaries, the check raises a warning in the dashboard and the value and crossed threshold are highlighted red in the checks view.
fr: Chaque valeur de sonde est comparée à ses seuils haut et bas. Si la valeur actuelle est en dehors de ses limites, la sonde donne lieu à une alerte dans le tableau de bord. De plus la valeur et le seuil franchi sont affichés en rouge dans la vue des sondes.

source: Fault Management. Server hardware error count (Solaris fmadm).
fr: Fault Management. Gestion des erreurs matérielles (fmadm sur Solaris).

source: Filesystems inodes usage percent.
fr: Taux d'utilisation des inodes d'un système de fichiers.

source: Filesystems usage percent.
fr: Taux d'utilisation d'un système de fichiers.

source: Link aggregate error count (Linux bonding, Solaris).
fr: Compteur d'erreurs des aggrégats de lien réseau (Linux bonding, Solaris).

source: More checks will be implemented depending on client needs.
fr: Plus de sondes sont développées au gré des besoins des clients.

source: Multipath valid path count (native multipath on Linux, HP-UX, Solaris, PowerPath).
fr: Compteur de chemins valides des multipaths (multipath natif sous Linux, HP-UX, Solaris et PowerPath).

source: Raid hardware error count (MegaRaid, SmartArray).
fr: Compteur d'erreur des cartes raid (MegaRaid, SmartArray).

source: Screenshot
fr: Copies d'écran

source: Setting thresholds
fr: Configuration des seuils

source: The OpenSVC agent schedule and ``om node checks`` push checkers values from the nodes to the collector. Current implemented checks are:
fr: Les tâches planifiées de l'agent OpenSVC et la commande ``om node checks`` envoient au collecteur les valeurs des sondes des noeuds. Les sondes implémentées à ce jour sont :

source: To change the threshold values of a set of check instances, check the corresponding rows in the table and click the :menuselection:`Set low threshold` or :menuselection:`Set high threshold`.
fr: Pour changer les valeurs de seuil d'un groupe d'instances de sondes, cocher les lignes correspondantes du tableau et cliquer sur :menuselection:`Paramétrer le seuil bas` or :menuselection:`Paramétrer le seuil haut`.

source: Usage
fr: Utilisation

source: Volume group usage percent.
fr: Taux d'utilisation d'un volume group
