Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/collector.stats.availability.po
Languages: fr

source: An acknowledged range will show the ack message, ack author and ack date when the cursor moves over the range dates.
fr: Un segment aquitté affiche le message d'aquittement, l'auteur de l'aquittement, et la date d'aquittement quand le curseur survole les dates limites du segment.

source: Clicking on a date will display a state transition graph to help determine which ressource caused to outage.
fr: Cliquer sur une date affiche un encart montrant les transitions d'état détaillées pour aider à déterminer quelle ressource est la cause d'une dégradation.

source: Each unavailability time range can be either:
fr: Chaque segment d'indisponibilité peut être :

source: Screenshot
fr: Copie d'écran

source: Service availability
fr: Disponibilité de service

source: The begin and end points of the analyzed period can be adjusted.
fr: Le début et la fin de la période analysée peuvent être ajustés.

source: The duration of this unvailability does not lowers the availability ratio. This is used to explain an unavailability range that was either planned or due to a collection error. The chart draws this state in grey.
fr: La durée de cette indisponibilité n'abaisse pas le taux de disponibilité. Ce mode est utilisé pour expliquer une indisponibilité prévue ou dûe à une interruption de service du collecteur. Le graphique montre cet état en gris.

source: The duration of this unvailability lowers the avail%. The chart draws this state in red.
fr: La durée de cette interruption de service est décomptée du taux de disponibilité. Le graphique affiche cet état en rouge.

source: The duration of this unvailability lowers the availability ratio. This is used to explain an undue unavailability. The chart draws this state in red.
fr: La durée de cette interruption de service abaisse le taux de disponibilité. Ce mode est utilisé pour expliquer une interruption non planifiée. Le graphique affiche cet état en rouge.

source: This view presents service availability data the collector collects. A chart helps detect the problems at a glance, and a table displays each unavailability time range and aggregate availability ratio on the selected period.
fr: Cette vue présente les informations sur la disponibilité des services dont le collecteur dispose. Un graphique aide à déceler les problèmes efficacement, et un tableau affiche chaque segment d'indisponibilité et calcule le taux de disponibilité sur la période analysée.

source: Usage
fr: Utilisation
