Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/collector.introduction.po
Languages: fr

source: :command:`comment`
fr: :command:`commentaire`

source: :command:`container name`
fr: :command:`nom de container`

source: :command:`container type`
fr: :command:`type de container`

source: :command:`drp node`
fr: :command:`noeud de pra`

source: :command:`drp nodes`
fr: :command:`noeuds de pra`

source: :command:`last update`
fr: :command:`Dernière mise à jour`

source: :command:`nodes`
fr: :command:`noeuds`

source: :command:`opensvc version`
fr: :command:`version d'opensvc`

source: :command:`primary node`
fr: :command:`noeud primaire`

source: :command:`responsibles mail`
fr: :command:`email des responsables`

source: :command:`responsibles`
fr: :command:`responsables`

source: :command:`status`
fr: :command:`état`

source: :command:`unackowledged errors`
fr: :command:`erreurs non-aquittées`

source: A column filters bar
fr: Une barre de filtres par colonne

source: A column selector
fr: Un sélecteur de colonne

source: A count of the unacknowledged errors on this service found in the actions table.
fr: Un compte d'erreurs non-acquittées pour ce service se trouve dans la vue des actions.

source: A csv export tool
fr: Un outil d'export au format csv

source: A newly created account has no privilege to see other users services. You have to ask admin@opensvc.com to add filters to your account so you can see your data. Filtering is based on domainnames patterns. You can declare as many domains as you need. The email address you setup during registration is important : it is used by the collector alarming subsystem as a mail sink for services you are responsible of.
fr: Un compte utilisateur fraîchement créé n'a pas le privilège de voir les services des autres utilisateurs. Il vous faut demander à admin@opensvc.com d'ajouter les filtres à votre compte nécessaires pour visualiser vos données. Le filtrage est basé sur les noms de domaine. Vous pouvez déclarer autant de domaines que nécessaire. L'adresse email que vous définissez pendant l'enregistrement du compte est importante : elle est utilisée pour le routage d'alertes concernant les services dont vous êtes responsable.

source: A pager
fr: Un outil de navigation dans les pages

source: A per-node wiki page the team responsible member can use to share information relative to the node.
fr: Une paje wiki spécifique au noeud, que ses responsables peuvent utiliser pour partager des informations s'y rapportant.

source: A persistent filters selector
fr: A sélecteur de filtres persistents

source: AND multiple patterns (%gie%&%adomain.com)
fr: ET entre expressions (%gie%&%adomain.com)

source: Account registration the SaaS collector at https://collector.opensvc.com is open to all.
fr: L'enregistrement d'un compte sur le collecteur SaaS https://collector.opensvc.com est ouvert à tous.

source: All nodes where the service may be running in degraded situation (not in disaster recovery situation).
fr: Tous les noeuds sur lesquels le service peut tourner en reprise sur incident (pas en reprise sur désastre).

source: All nodes where the service may be running in disaster recovery situation.
fr: Tous les noeuds sur lesquels le service peut tourner en reprise sur désastre.

source: Collector
fr: Collecteur

source: Column filters bar
fr: Barre de filtres par colonne

source: Column selector
fr: Sélecteur de colonnes

source: Data views are accessed through the tabulations in the site's pages header.
fr: Les vues sont accédées par les menus en tête de paje.

source: Display the per-node per-resource detailled service status.
fr: Affiche les états détaillés des ressources du service.

source: Display the per-node synthetic service status.
fr: Affiche les états aggrégés des services sur les noeuds.

source: Display the raw service configuration file pushed by the nodeware.
fr: Affiche le fichier de configuration brut d'un service, tel que poussé par l'agent.

source: Displays:
fr: Affiche :

source: Each column of the table supports filtering. Filters are applied upon ``<enter>`` in any filter box. Filter box expressions are AND'ed. Filter syntax supports :
fr: Chaque colonne de la table est apte au filtrage. Les filtres sont activés par pression sur ``<Entrée>`` dans n'importe quelle boite de saisie de filtre. Les expressions des différents filtres de colonne sont aggégées par des ET logiques. Leur syntaxe comprend :

source: Each view has:
fr: Chaque vue dispose de :

source: Filters can be designed from the :menuselection:`Admin --> Filters` view.
fr: Les filtres peuvent être créés dans la vue :menuselection:`Admin --> Filtres`

source: Generate and display graphs of performance metrics on the user-selected time range. The metrics are gathered daily from tools like glance and sar running on the nodes. The opensvc agent pushes this information to database.
fr: Génère et affiche les courbes de performance sur la durée choisie par l'utilisateur. Les métriques sont collectées quotidiennement depuis les statistiques d'outils comme sar et glance qui tournent sur les noeuds. L'agent OpenSVC est responsable de pousser ces informations au collecteur.

source: Host Name of the virtual machine encapsulated in the service, if any.
fr: Le nom d'hôte de la machine virtuelle encapsulée dans le service, si applicable.

source: Host name of the node the service should be running in a disaster recovery situation.
fr: Le nom d'hôte du noeud sur lequel le service devrait tourner en cas de reprise sur sinistre.

source: Host name of the node where the service should be running in optimal situation.
fr: Le nom d'hôte du noeud sur lequel le service devrait tourner en situation optimale.

source: In all views, clicking on a node name will open the node tabs to display the most comprehensive data set the collector knows about this node. server, os, mem, cpu, location, power
fr: Dans toutes les vues, cliquer sur un nom de noeud ouvre un encart tabulé qui affiche l'intégralité des informations disponibles sur le noeud dans la base du collecteur. Serveur, système d'exploitation, mémoire, processeurs, géolocalisation, alimentation

source: In all views, clicking on a service name will open the service tabs to display the most comprehensive data set the collector knows about this service.
fr: Dans toutes les vues, cliquer sur un nom de service ouvre un encart tabulé qui affiche l'intégralité des informations disponibles sur le service dans la base du collecteur.

source: Information displayed in these tabs are extracted from the asset table. Assets can be loaded from a tiers enterprise asset manager or filled-in manually.
fr: Les informations affichées dans ces tabulations sont issues de la table des assets. Cette table peut être alimentée depuis un gestionnaire d'asset tiers ou alimentée manuellement.

source: Internet collector account configuration
fr: Configuration des comptes utilisateur du collecteur internet

source: List of administrators contact emails for this service.
fr: Liste des adresses email des administrateurs de ce service.

source: List of administrators contact names for this service.
fr: Liste des noms des administrateurs de ce service.

source: Metrics collection depend on the operating system. Some of them are:
fr: La liste des métriques dépend du système d'exploitation. On y trouve :

source: Multiple character wildcard for SQL expressions. Can be used as a header, trailer or in the middle of a pattern (%gie%01%)
fr: Wildcard pour une suite de caractères dans une expression SQL. Peut être utilisé en tête, en fin ou au sein d'une expression (%gie%01%)

source: Negate the pattern (!%gie%&%adomain.com)
fr: Négation de l'expression (!%gie%&%adomain.com)

source: Node tabs
fr: Tabulations d'un noeud

source: OR multiple patterns (%gie%|%adomain.com)
fr: OU entre expressions (%gie%|%adomain.com)

source: Persistent filters
fr: Filtres persistants

source: Pushed to database daily by the opensvc nodeware cronjob.
fr: Poussé en base du collecteur quotidiennement par les tâches planifiées de l'agent.

source: Pushed to database daily by the opensvc nodeware cronjob. This information resides in the service env file on the nodes.
fr: Poussé en base du collecteur quotidiennement par les tâches planifiées de l'agent. Cette information dérive du fichier env des services sur les noeuds.

source: Select only cells with value inforior or equal to specified value or date (<=2012-04-01)
fr: Retenir les cellules dont la valeur est inférieure ou égale à la valeur ou la date spécifiée (<=2012-04-01)

source: Select only cells with value inforior to specified value or date (<2012-04-01)
fr: Retenir les cellules dont la valeur est inférieure à la valeur ou la date spécifiée (<2012-04-01)

source: Select only cells with value superior or equal to specified value or date (>=2012-04-01)
fr: Retenir les cellules dont la valeur est supérieure ou égale à la valeur ou la date spécifiée (>=2012-04-01)

source: Select only cells with value superior to specified value or date (>2012-04-01)
fr: Retenir les cellules dont la valeur est supérieure à la valeur ou la date spécifiée (>2012-04-01)

source: Select only empty cells (!empty)
fr: Retenir les cellules vides uniquement (!empty)

source: Service tabs
fr: Tabulations d'un service

source: Service type can be PRD, DEV, ...
fr: Le type de service peut être PRD, DEV, ...

source: Single character wildcard for SQL expressions. Can be used as a header, trailer or in the middle of a pattern (%gie%01%)
fr: Wildcard pour un caractère unique dans une expression SQL. Peut être utilisé en tête, en fin ou au sein d'une expression (%gie%01%)

source: Sketches service-nodes-storage-sites relationships
fr: Représente les relations entre services, noeuds, stockages et sites

source: The active filter is stored in database and applied on all collector views. It persists across navigation sessions. Upon filter selection, the view is reloaded.
fr: Le filtre actif est stocké en base de données et s'applique à toutes les vues. Il persiste entre sessions de navigation. Quand un filtre est choisi, la vue courrante est rechargée.

source: The collector centralizes the agents data and provides advanced filtering, reporting and accounting features.
fr: Le collecteur centralise les informations glanées depuis les agents et fournit les capacités de filtrage, de mise en rapports et de comptabilité.

source: The collector is commercially licensed web 2.0 site available either in SaaS mode or in client-hosted mode. Contact sales@opensvc.com for licensing information.
fr: Le collecteur est un site web 2.0, commercialisé sous license, disponible soit en mode SaaS, soit déployé sur les sites clients. Contactez sales@opensvc.com pour obtenir les détails concernant le mode de license.

source: The current node ruleset
fr: Le jeu de règles actuel du noeud

source: The current per-module compliance status of the node
fr: L'état actuel de conformité du noeud, module par module

source: The modulesets attached to the node
fr: Les jeux de modules attachés au noeud

source: Timestamp updated upon service information receive from the nodeware cronjob.
fr: Un horodatage mis à jour quand l'agent envoit les configurations de service.

source: View columns can be toggled on and off from the column selector. Each view has a default set of column displayed. User column selection is stored in database, thus persistent across user sessions and different browsing devices.
fr: Les colonnes des vues peuvent être affichées ou masquées grace au sélecteur de colonnes. Chaque vue a un jeu de colonnes affichées par défaut. La sélection de colonnes d'un utilisateur est stockée en base de données. Elle est donc persistante entre sessions de navigation et entre appareils de consultation.

source: View-specific tools
fr: Outils spécifiques aux vues

source: Views
fr: Vues

source: Views present data as tables.
fr: Les vues présentent les données sous forme de tableau.

source: Virtualisation driver to handle the encapsulated virtual machine, if any.
fr: Pilote de virtualisation utilisé pour gérer la machine virtuelle du service, si applicable.

source: all-disks: io/s, bandwidth
fr: tous les disques : io/s, bande passante

source: compliance
fr: conformité

source: cpu: usr, sys, wait, irq, guest, steal, idle, nice, iowait, soft
fr: processeur: usr, sys, wait, irq, guest, steal, idle, nice, iowait, soft

source: load: avg1, avg5, avg15, runq size, proc list size
fr: charge : avg1, avg5, avg15, runq size, proc list size

source: mem: commit, free, used by usr, buffer, cache, sys
fr: mémoire : commit, free, used by usr, buffer, cache, sys

source: per-disk: io/s, request size, wait time, service time, %util, bandwidth
fr: par disque : io/s, taille de requête, temps d'attente, temps de service, %util, bande passante

source: properties
fr: propriétés

source: resources
fr: ressources

source: swap: free, used, used but cached
fr: swap : libre, utilisé, utilisé mais en cache

source: topology
fr: topologie

source: |video-icon| `Watch a video <http://www.youtube.com/watch?feature=player_embedded&v=32pyu623U7A>`_
fr: |video-icon| `Regarder une vidéo <http://www.youtube.com/watch?feature=player_embedded&v=32pyu623U7A>`_

source: |video-icon| `Watch a video <http://www.youtube.com/watch?feature=player_embedded&v=8PLTJuEOHRs>`_
fr: |video-icon| `Regarder une vidéo <http://www.youtube.com/watch?feature=player_embedded&v=8PLTJuEOHRs>`_

source: |video-icon| `Watch a video <http://www.youtube.com/watch?feature=player_embedded&v=tEqKPRZ4YeA>`_
fr: |video-icon| `Regarder une vidéo <http://www.youtube.com/watch?feature=player_embedded&v=tEqKPRZ4YeA>`_
