Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/collector.view.actions.po
Languages: fr

source: **Begin**
fr: **Début**

source: **End**
fr: **Fin**

source: **Learn which system commands are run by the nodeware**
fr: **Découvrir quelles commandes système sont utilisées par l'agent**

source: **Log**
fr: **Journal**

source: **Node**
fr: **Noeud**

source: **Problem patterns**
fr: **Récurrence des problèmes**

source: **Quick insight of unacknowledged errors affecting a specific perimeter**
fr: **Apperçu rapide des erreurs non aquittées affectant un périmètre particulier**

source: **Responsible**
fr: **Responsable**

source: **Retrospective problem analysis**
fr: **Analyse rétrospective des problèmes**

source: **Status**
fr: **Etat**

source: **Trace who was alerted of a problem, and when**
fr: **Consulter qui a été alerté d'un problème, et quand**

source: Actions view
fr: Vue des actions

source: Begin timestamp of the action.
fr: Horodatage du début d'action.

source: Dashboard notifications
fr: Notifications dans le tableau de bord

source: End timestamp of the action.
fr: Horodatage de fin d'action.

source: Example: ``ack=0 & status=err & responsible=me``
fr: Exemple : ``ack=0 & status=err & responsible=me``

source: Example: ``log=%sg_persist%|%scu%``
fr: Exemple : ``log=%sg_persist%|%scu%``

source: Example: ``service=some_service & action=syncnodes & status!=ok``
fr: Exemple : ``service=some_service & action=syncnodes & status!=ok``

source: Example: ``service=some_service & begin>2010-01-10% & end<2010-01-12%``
fr: Exemple : ``service=some_service & begin>2010-01-10% & end<2010-01-12%``

source: Fields
fr: Champs

source: Node where the action has be executed. The node name is a link to the asset view.
fr: Le noeud sur lequel l'action a été exécutée. Ce nom est un lien vers la vue des assets.

source: Process identifier of the session handling the action on the node. Click to active a pid filter with this value.
fr: Identificateur de processus de la session en charge de l'exécution de l'action sur le noeud. Cliquer pour activer un filtre sur cette valeur de pid.

source: Screenshot
fr: Copies d'écran

source: Service action error count
fr: Compteur d'erreurs d'action sur les services

source: Service name the action applied to. Private collectors usually report shortnames, shared collectors usually report service names with domain names.
fr: Le nom du service sur lequel l'action prend effet. Les collecteurs privés mentionnent souvent des noms courts, alors que les collecteurs SaaS mentionnent des noms incluant le nom du domaine.

source: Status Description
fr: Description de l'état

source: The action completed succesfully.
fr: L'action a été exécutée avec succès.

source: The action completed with some error. Acknowledged by a user.
fr: L'action a été exécutée avec des erreurs. Aquittées par un utilisateur.

source: The action completed with some error. Investigation and acknowledgement are needed.
fr: L'action a été exécutée avec des erreurs. Investigation et aquittement requis.

source: The action completed with some warnings. No acknowledgement needed.
fr: L'action a été exécutée avec des avertissement. Pas d'aquittement nécessaire.

source: The action log as it is displayed on the node standart output.
fr: Le journal de l'action tel qu'il a été affiché sur la sortie standard du noeud.

source: The application code is a way to group services dedicated/paid by some corporate entity or project. You can setup any application code you want in your services configuration file, using the app parameter.
fr: Le code applicatif est un moyen de grouper les services dédiés ou financés par une entité ou un projet de l'entreprise. Vous pouvez choisir le code applicatif d'un service dans son fichier de configuration, en utilisant le paramère 'app'.

source: The collector has been informed of the action begining but has no yet received ending logs.
fr: Le collecteur a été informé d'un début d'action mais n'a pas encore reçu les journaux sur fin d'action.

source: The executed action name. An action usually aggregates a number of log lines, plus a line with no log message as a header. The default action view has an 'empty' log filter active so you are presented only actions without their logs. You can drill down a specific action by clicking on its pid.
fr: Le nom de l'action exécutée. Une action regroupe en général un certain nombre de lignes de journal, plus une ligne d'en-tête, sans journal associé. La vue par défaut a un filtre 'empty' dans la colonne journal, afin que ne soient présentées que les lignes d'en-tête. Il est possible de consulter le journal d'une action en cliquant sur son pid.

source: The responsibles are persons receiving alerts for a service. Hovering the mouse over the icon spawns the name of the responsibles. No icon means no responsible, which is an anomaly, and as such, cause alerts to be emitted to the site's administrator/manager.
fr: Les responsables sont les individus recevant les alerts d'un service. Le survol du pointeur au dessus de l'icône fait apparaitre le nom des responsables. L'absence d'icône identique l'absence de responsable, ce qui est une anomalie, et en tant que tel, cause le routage des alertes vers les utilisateurs 'Manager' du site.

source: This view displays the journal of all services events with their status.
fr: Cette vue affiche les journaux des actions exécutées sur tous les services et leur état.

source: Typical usage:
fr: Utilisation usuelle :

source: Usage
fr: Utilisation

source: acquire scsi persistent reservations on disks of the service (wrapped by startvg and startdisk)
fr: Aquérir les réservations persistentes scsi sur les disques du service (également déclenché par startvg et startdisk)

source: err (strikethrough)
fr: err (barré)

source: print status of all service resources
fr: affiche les états de toutes les ressources du service

source: release scsi persistent reservations on disks of the service (wrapped by stopvg and stopdisk)
fr: Libère les réservations persistentes scsi des disques du service (également déclenché par stopvg et stopdisk)

source: start resources of type : disk group
fr: démarre les ressources de type : disk group

source: start resources of type : fs
fr: démarre les ressources de type : fs

source: start resources of type : ip
fr: démarre les ressources de type : ip

source: start resources of type : ip, loop, disk group, zpool, fs, container, app
fr: démarre les ressources de type : ip, loop, disk group, zpool, fs, container, app

source: start resources of type : loop
fr: démarre les ressources de type : loop

source: start resources of type : loop, disk group, zpool, fs
fr: démarre les ressources de type : loop, disk group, zpool, fs

source: stop resources of type : app, container, fs, zpool, disk group, loop, ip
fr: arrête les ressources de type : app, container, fs, zpool, disk group, loop, ip

source: stop resources of type : disk group
fr: arrête les ressources de type : disk group

source: stop resources of type : fs
fr: arrête les ressources de type : fs

source: stop resources of type : fs, zpool, disk group, loop
fr: arrête les ressources de type : fs, zpool, disk group, loop

source: stop resources of type : ip
fr: arrête les ressources de type : ip

source: stop resources of type : loop
fr: arrête les ressources de type : loop

source: trigger hard-coded and user-defined file synchronization to disaster recovery nodes. Optionally creates snapshots to send a coherent file set. No-op if run from a node not running the service.
fr: déclenche les synchronisations de données codées en dur et celles définies par l'utilisateur vers les noeuds de reprise sur sinistre. Accessoirement, crée les snapshots pour envoyer un jeu de données cohérent. Sans effet si lancé depuis un noeud ou le service n'est pas actif.

source: trigger hard-coded and user-defined file synchronization to secondary nodes. Optionally creates snapshots to send a coherent file set. No-op if run from a node not running the service.
fr: déclenche les synchronisations de données codées en dur et celles définies par l'utilisateur vers les noeuds de reprise sur incident. Accessoirement, crée les snapshots pour envoyer un jeu de données cohérent. Sans effet si lancé depuis un noeud ou le service n'est pas actif.

source: warn
fr: attention
