Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/compliance.modules.po
Languages: fr

source: A module can be either a file or a directory tree. The top-level file or directory name must comply to the naming convention::
fr: Un module peut être composé d'un seul fichier, ou d'une arborescence parentée à un répertoire. Le fichier unique ou le répertoire père doit se conformer à la convention de nommage suivante ::

source: A module can be implemented in any programing langage : shell scripts, python, perl, C, ...
fr: Un module peut être développé dans n'importe quel langage de programmation : scripts shell, perl, C, ...

source: A module must return one of those three possible values
fr: Un module doit renvoyer une de ces trois valeurs

source: A module must support only one mandatory argument. Its' values can be either
fr: Un module ne doit supporter qu'un seul paramètre. Sa valeur peut être

source: Apply the rules on the node or service
fr: Appliquer les règles au noeud ou au service

source: Basics
fr: Bases

source: Compliance Objects
fr: Objets de conformité

source: Compliance checks or fixes are not applicable. For example when no rules are made available to the module.
fr: Les vérifications et les corrections de conformité ne sont pas applicables. Par exemple parcequ'aucune des règles attendues par le module ne sont exportées.

source: Compliance checks or fixes failed.
fr: Les vérifications et les corrections de conformité ont échoué

source: Compliance checks or fixes passed.
fr: Les vérifications et les corrections de conformité ont réussi

source: File naming conventions
fr: Convention de nommage des fichiers

source: If the module top-level object is a directory, the file tree under it must be either::
fr: Si l'object de plus haut niveau est un répertoire, l'arborescence sous-jacente doit être soit ::

source: Location
fr: Emplacement

source: Module skeleton
fr: Squelette d'un module

source: Modules are installed in ``/opt/openvc/var/compliance``.
fr: Les modules sont installés dans ``/opt/openvc/var/compliance``.

source: Modules development
fr: Développement des modules

source: Objects take complex serialized rules as input, and the collector implements forms to easily create those rules.
fr: Les objets utilisent des règles complexes sous forme de dictionnaire sérialisés, et le collecteur dispose de formulaires pour créer facilement ces règles.

source: OpenSVC distributes a collection of compliance objects, implemented as executable python classes, to ease module development. They implement common checks and fixes. The skeletons presented below make use of these objects.
fr: OpenSVC distribue un ensemble d'objets de conformité, implémentées sous forme de classes python exécutables, afin de faciliter le développement des modules. Ils implémentent des fonctions de vérification et de correction pour les besoins de base. Les squelettes présentés ci-bas utilisent ces objets.

source: Parameters
fr: Paramètres

source: Python script
fr: Scripts python

source: Return code
fr: Code retour

source: Rules
fr: Règles

source: Shell script
fr: Script shell

source: The called action : fix, fixable or check
fr: L'action demandée : fix, fixable ou check

source: The calling modules have to specify to the object 2 informations:
fr: Les modules appelants doit spécifier aux objets deux informations :

source: The rules are passed to the modules through environment variables. Advanced langages can use complex serialized variable values like JSON or XML.
fr: Les règles sont passées aux modules par l'intermédiaire de variables d'environnement. Les langages de programmation avancés peut faire usage de valeurs de variables complexes sous forme de dictionnaires sérialisés par JSON ou XML.

source: The variable name prefix the object must care about. The object will search the environment for variables matching this prefix.
fr: Le préfixe du nom des variables que l'objet doit prendre en considération. L'objet cherchera dans l'environnement toutes les variables correspondantes à ce préfixe.

source: Verify the module can apply the rules on the service or node.
fr: Vérifier que le module est capable d'assurer les corrections sur le service ou le noeud.

source: Verify the rules are applied on the node or service.
fr: Vérifier que les règles sont correctement appliquées sur le noeud ou le service.

source: or::
fr: ou ::
