Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/compliance.modules.deploy.po
Languages: fr

source: After the mirror initialization, you have to update the current link according to your own policies.
fr: Après l'initialisation du miroir, il reste à mettre à jour le lien current selon votre politique.

source: Initialize the repository
fr: Initialisation du dépôt

source: Modules can be deployed using one of the following methods:
fr: Les modules peuvent être déployés par une des méthodes suivantes :

source: Modules deployment
fr: Déploiement des modules

source: Pull mode : each node is responsible from fetching the modules from a repository
fr: Par récupération : chaque noeud est responsable de la récupération des modules depuis un dépôt

source: Push mode : a trusted server is responsible of pushing the modules to the nodes. The difficult part is the target node listing. Such lists can be extracted from the collector database.
fr: Par diffusion : un serveur de confiance est responsable de la diffusion des modules vers tous les noeuds. Le point délicat est l'inventaire des noeuds vers lesquels effectuer la diffusion. Cet inventaire peut être extrait de la base de données du collecteur.

source: Set up the agents
fr: Configuration des agents

source: Set up the published version
fr: Configuration des versions publiées

source: The OpenSVC agent downloads the file pointed by the link named ``current``.
fr: L'agent OpenSVC télécharge le fichier pointé par le lien nommé ``current``.

source: The compliance modules must be installed on all nodes with modulesets attached. All modules can be safely installed : only the modules included in attached modulesets are used. The modules must be installed in ``/opt/opensvc/var/compliance/``.
fr: Les modules de conformité doivent être présents sur tous les noeuds sur lesquels sont attachés des jeux de modules. Tous les modules peuvent être déployés sans risque : seuls les modules des jeux de modules attachés seront planifiés pour exécution. Les modules doivent être présent dans ``/opt/opensvc/var/compliance/``.

source: The repository must be known to the agent. This set up is done with either the node.repo or the node.repocomp ``node.conf`` parameters.
fr: Le dépôt doit être connu de l'agent. Cette configuration est faite par les paramètres node.repo ou node.repocomp du fichier de configuration ``node.conf``.

source: This chapter describes the last method.
fr: Ce chapitre décrit cette dernière méthode.

source: This command is operating system agnostic.
fr: Cette commande est agnostique au système d'exploitation.

source: This parameter allows to set up a URI pointing to a pure OpenSVC agent compliance repository. If specified node.repocomp overrides node.repo.
fr: Ce paramètre permet de configurer une URI pointant un pur dépôt de conformité. Si le paramètre node.repocomp est configuré, il prend le pas sur node.repo.

source: This parameter allows to set up a URI pointing to a repository hosting both compliance gzipped tarballs in the compliance/ subdirectory and OpenSVC agent packages in the packages/ subdirectory.
fr: Ce paramètre permet de configurer une URI pointant un dépôt hébergeant à la fois les tarball gzippés de la comformité dans le sous-répertoire compliance/ et les paquets de l'agent OpenSVC dans le sous-répertoire packages/.

source: Updating the modules
fr: Mise à jour des modules
