Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/compliance.concepts.po
Languages: fr

source: A filter is a SQL-like condition on information available to the collector.
fr: Un filtre est une expression conditionnelle similaire à une expression SQL qui s'applique à un type d'information disponible en base de données du collecteur.

source: A filterset is a combination of filters or filtersets. Filters are created through the top table and filterset created through the bottom table. Only member of the 'CompManager' group are allowed to create or edit filters.
fr: Un jeu de filtres est une combinaison entre filtres ou jeux de filtres. Les filtres sont créés par le tableau du haut et les jeux de filtres sont assemblés par le tableau du bas de paje. Seuls les membres du groupe 'CompManager' sont autorisés à créer ou éditer des filtres.

source: A rule value can be complex, for example a json-serialized dictionnary. OpenSVC ships with python objects for you to use in your modules and corresponding collector wizard. These objects use such complex rules without you facing the complexity.
fr: La valeur d'une règle peut être complexe, par exemple un dictionnaire sérialisé au format JSON. OpenSVC livre des objets python utilisables dans vos propres modules de conformité. Ces objets utilisent de tels dictionnaires, mais leur complexité est masquée par la présence de wizards qui facilitent la saisie et la visualisation des valeurs.

source: A run over run status sparkline. This columns present no timeline information.
fr: Une mini-courbe des résultats successifs des vérifications de conformité. Cette colonne ne contient pas d'informations temporelles.

source: A typical filterset would be 'All Red Hat 4 servers whose team responsible is SomeTeam'.
fr: Un jeu de filtre classique pourrait être 'Tous les serveurs Red Hat 4 dont l'équipe est responsable est MonEquipe

source: Add variables
fr: Ajouter des variables

source: All matching rulesets' rules are visible to all modules of attached modulesets
fr: Toutes les règles des jeux de règles correspondants sont visibles de tous les modules des jeux de modules attachés

source: Apply and verify the rules.
fr: Appliquent et vérifient les règles.

source: Attach filterset
fr: Attacher un jeu de filtres

source: Attach rulesets to nodes
fr: Attcher un jeu de règles à des noeuds

source: Auditable host configurations
fr: Configuration des noeuds auditables

source: Available operators are ``>``, ``<``, ``=``, ``!=``, ``IN`` and ``LIKE``
fr: Les opérateurs disponibles sont ``>``, ``<``, ``=``, ``!=``, ``IN`` et ``LIKE``

source: Best practice
fr: Bonnes pratiques

source: Check the nodes in the left-side table
fr: Cocher les noeuds dans la table de gauche

source: Check the rulesets in the right-side table
fr: Cocher les jeux de règles dans la table de droite

source: Choose a field name. Available field names: 'warranty_end', 'status', 'role', 'environnement', 'mem_bytes', 'mem_banks', 'mem_slots', 'os_vendor', 'os_name', 'os_kernel', 'os_release', 'os_arch', 'cpu_freq', 'cpu_dies', 'cpu_cores', 'cpu_model', 'cpu_vendor', 'type', 'nodename', 'team_responsible', 'serial', 'model', 'loc_addr', 'loc_city', 'loc_zip', 'loc_rack', 'loc_floor', 'loc_country', 'loc_building', 'loc_room', 'power_supply_nb', 'power_cabinet1', 'power_cabinet2', 'power_protect', 'power_protect_breaker', 'power_breaker1', 'power_breaker2', 'updated'
fr: Choisir un nom de champ. Les champs disponibles sont : 'warranty_end', 'status', 'role', 'environnement', 'mem_bytes', 'mem_banks', 'mem_slots', 'os_vendor', 'os_name', 'os_kernel', 'os_release', 'os_arch', 'cpu_freq', 'cpu_dies', 'cpu_cores', 'cpu_model', 'cpu_vendor', 'type', 'nodename', 'team_responsible', 'serial', 'model', 'loc_addr', 'loc_city', 'loc_zip', 'loc_rack', 'loc_floor', 'loc_country', 'loc_building', 'loc_room', 'power_supply_nb', 'power_cabinet1', 'power_cabinet2', 'power_protect', 'power_protect_breaker', 'power_breaker1', 'power_breaker2', 'updated'

source: Choose a name for the cloned ruleset
fr: Choisir un nom pour le jeu de règles cloné

source: Choose a pre-existing filterset from the list box
fr: Choisir un jeu de filtre existant depuis la liste

source: Choose a pre-existing ruleset from the list box
fr: Choisir un jeu de règle existant depuis la liste

source: Choose a table name. Available table names: 'nodes'
fr: Choisir un nom de table. Les tables disponibles sont : 'nodes'

source: Choose a unique ruleset name
fr: Choisir un nom de jeu de règle unique

source: Choose a variable name
fr: Choisir un nom de variable

source: Choose a variable value
fr: Choisir une valeur de variable

source: Choose an operator. Available operators: '=', 'LIKE', 'NOT LIKE', '<', '<=', '>', '>=', 'IN', 'NOT IN'
fr: Choisir un opérateur. Les opérateurs disponibles sont '=', 'LIKE', 'NOT LIKE', '<', '<=', '>', '>=', 'IN', 'NOT IN'

source: Choose contextual/explicit
fr: Choisir entre contextuel et explicite

source: Choose the filterset or filter to attach in the list box
fr: Choisir le jeu de filtres ou le filtre à attacher depuis la liste

source: Choose the filterset to attach to in the list box
fr: Choisir le jeu de filtres à attacher depuis la liste

source: Click 'Add variable'
fr: Cliquer sur 'Ajouter une variable'

source: Click 'Attach filterset'
fr: Cliquer sur 'Attacher un jeu de filtres'

source: Click 'Attach filterset' or 'Attach filter'
fr: Cliquer sur 'Attacher un jeu de filtres' ou 'Attacher un filtre'

source: Click 'Attach ruleset'
fr: Cliquer sur 'Attacher un jeu de règles'

source: Click 'Clone ruleset'
fr: Cliquer sur 'Cloner un jeu de règles'

source: Click 'Create filter'
fr: Cliquer sur 'Créer un filtre'

source: Click 'Create filterset'
fr: Cliquer sur 'Créer un jeu de filtres'

source: Click 'Create ruleset'
fr: Cliquer sur 'Créer un jeu de règles'

source: Click 'Submit'
fr: Cliquer sur 'Soumettre'

source: Click either the variable name or the variable value top-right 'edit' icon
fr: Cliquer sur le nom de la variable ou sur l'icône 'éditer' en haut à droite de sa valeur

source: Click on 'Submit'
fr: Cliquer sur 'Soumettre'

source: Clone ruleset
fr: Cloner un jeu de règles

source: Cloning a ruleset helps administrators who want their rulesets immutable : when a variable change is needed, the administrator clones the ruleset and apply the change to the clone. This governance policy implies ruleset names are versioned.
fr: Le clonage de jeu de règles est notamment utile aux administrateurs qui souhaitent leurs jeux de règles immuables : Quand un changement de variable est nécessaire, l'administrateur clone le jeu de règle et applique le changement au clone. Cette politique de gouvernance implique le versionnement des noms de jeu de règles.

source: Collector compliance views
fr: Vues du collecteur pour la conformité

source: Collector's interfaces to analyze compliance data and to configure the framework are all grouped in the menu ``Views > Compliance``.
fr: Les interfaces du collecteurs dédiées à l'analyse des données de conformité et à la configuration du sous-système sont groupées derrière le menu ``Vues -> Conformité``.

source: Compliance conceptual objects
fr: Objets conceptuels de la conformité

source: Contextual ruleset variables are exported to the group of nodes matching the ruleset's filterset. Explicit rulesets
fr: Les variables des jeux de règles contextuels sont exportées au groupe de noeuds qui correspondent au jeu de filtres du jeu de règles.

source: Create a filter
fr: Créer un filtre

source: Create a filterset
fr: Créer un jeu de filtres

source: Create an empty ruleset
fr: Créer un jeu de règles vide

source: Detailled compliance status
fr: Etats détaillés de conformité

source: Each module picks the rules it is coded to pick
fr: Chaque module consomme les règles auxquelles son code s'intéresse

source: Ease change management
fr: Facilité la gestion du changement

source: Edit the input or content
fr: Editer le contenu de la cellule ou le formulaire

source: Edit variables
fr: Modifier les noms variables

source: Explicit ruleset variables are exported only to nodes explicitely attached to the ruleset. This attachment can be configured either through the collector interface (Described below), or through the agent command line tools::
fr: Les variables des jeux de règles explicites ne sont exportées qu'aux noeuds explicitement attachés à ces jeux de règles. Ces attachement sont réalisés soit par l'interface du collecteur (voir ci-bas), soit par la ligne de commande de l'agent ::

source: Fast and reliable nodes and services provisioning
fr: Provisioning de noeuds et de services rapide et fiable

source: Filterable information is grouped into 3 categories : node, service and service status.
fr: Les informations filtrables sont groupées en 3 catégories : noeud, service et états de services.

source: Filters
fr: Filtres

source: Filters must be grouped into filtersets.
fr: Les filtres doivent être groupés en jeux de filtres.

source: Filtersets are created empty, then filters or filtersets are attached to the new filterset.
fr: Les jeux de filtres sont initialisé vides, puis des filtres ou d'autres jeux de filtres y sont attachés.

source: Filtersets can be grouped into filtersets.
fr: Les jeux de filtres sont aggrégeables pour former d'autres jeux de filtres.

source: If the ruleset is contextual, the following procedure attach a filter to the ruleset.
fr: Si le jeu de règles est contextuel, la procédure suivante permet d'y attacher un jeu de filtre.

source: It is recommended for readability to define filtersets combining with only one logical operator (only ANDs or ORs). For example, a filterset implementing 'all Linux or HP-UX servers whose team responsible is SOMETEAM should be implemented as 2 encapsulated filtersets:
fr: Il est recommandé pour des raisons de lisibilité de définir des jeux de filtres liant les filtres avec un seul type d'opératoire (soit que des ET, soit que des OU). Par exemple, un jeu de filtres traduisant 'Tous les serveur Linux ou HP-UX dont l'équipe responsable est MonEquipe' serait bâtie par encapsulation de deux jeux de filtres :

source: Logs
fr: Journaux

source: Modules are grouped into modulesets
fr: Les modules sont groupés en jeux de modules

source: Modulesets are explicitely attached to nodes
fr: Les jeux de modules sont attachés explicitement aux noeuds

source: Of course, more explicit filterset names are recommended.
fr: Evidemment, des noms de jeu de filtres plus explicites sont recommandés.

source: Only member of the 'CompManager' group are allowed to create or edit modulesets.
fr: Seuls les membres de 'CompManager' sont habilités à créer ou modifier des jeux de modules.

source: OpenSVC implements a versatile compliance framework. It allows administrators to describe the corporate server configuration ruleset in a central, auditable place. OpenSVC agent modules compare the actual server configuration to the expected configuration and log the result to the collector.
fr: OpenSVC embarque un sous-système de conformité très souple. Il permet aux administrateurs de décrire les règles de configuration des serveurs de l'entreprise dans un point central et auditable. Les agents OpenSVC font tourner des modules dont le rôle est de comparer les configurations réelles avec les configurations cibles, et de rapporter le résultat de l'analyse au collecteur.

source: Optionally set an order. Defaults to '0'. Ordering is important when you mix 'AND' and 'OR' in the same filterset
fr: Eventuellement, forcer un rang. Le rang par défaut est '0'. Le rang est important quand les opérateur 'ET' et 'OU' sont utilisés simultanéement dans le même jeu de filtres.

source: Per-module compliance status
fr: Etats de conformité aggrégés par module

source: Per-node compliance status
fr: Etats de conformité aggrégés par noeud

source: Per-service compliance status
fr: Etats de conformité aggrégés par service

source: Populate a filterset
fr: Polupler le jeu de filtres

source: Press 'Enter' to save the change
fr: Appuyer sur 'Enter' pour sauvegarder les changements

source: Rules
fr: Règles

source: Rules are expressed as variable/value pairs. Rules can be grouped into rulesets. Only members of the 'CompManager' group are allowed to create or edit rulesets. Contextual rulesets
fr: Les règles sont exprimées sous forme de couples variable/valeur. Elles peuvent être groupées en jeux de règles. Seuls les membres de 'CompManager sont habilités à créer ou modififier des jeux de règles.

source: Rules are grouped into rulesets.
fr: Les règles sont groupées en jeux de règles.

source: Rules are variable/value pairs exported in the execution environment of the modules.
fr: Les règles sont des couples variable/valeur exportés dans l'environnement d'exécution des modules.

source: Rulesets can be contextually attached to nodes through a filterset.
fr: Les jeux de règles peuvent être contextuellement attachés à des noeuds, par l'intermédiaire d'un jeu de filtres.

source: Rulesets can be explicitely attached to nodes.
fr: Les jeux de règles peuvent être attachés explicitement à des noeuds.

source: Set a filter value. The wildcard character for the 'LIKE' and 'NOT LIKE' operators is '%'. List values for the 'IN' and 'NOT IN' operators are comma-separated.
fr: Positionner une valeur au filtre. Le caractère va-tout pour les opérateur 'LIKE' et 'NOT LIKE' est '%'. Le séparateurs pour les valeurs en liste des les opérateurs 'IN' et 'NOT IN' est la virgule.

source: Set a filterset name
fr: Choisir un nom pour le jeu de filtres

source: Set a logical operator to combine the filter/filterset with. Available logicial operators: 'AND', 'OR'.
fr: Choisir un opérateur logique pour assembler les filtres ou jeux de filtres entre eux. Les opérateurs disponibles dont 'AND' et 'OR'.

source: Status
fr: Etats

source: Switch between compliance sub-views using the menu:
fr: La navigation entre les sous-vues de conformité en utilisant le menu :

source: The "compliance" concept is all about mesuring the adherence of the hosts' configurations to the site's rules. The goals are:
fr: Le concept de conformité a pour finalité la mesure de la disparité des configurations réelles des serveurs par rapport aux configurations prévues. Les enjeux en sont :

source: The compliance module name.
fr: Le nom du module de conformité.

source: The compliance framework can be used for host post-installation. This strategy ensures a new delivered host is compliant with the current rulesets and is checked for drift afterwards.
fr: Le sous-système de conformité peut être utilisé en post-installation des serveurs. Cette stratégie garantie qu'un nouveau serveur préparé est conforme aux règles de site, et que la dérive de ses configurations après livraison sera mesurée.

source: The compliance framework uses 3 types of obects.
fr: Le sous-sytème de conformité utilise 3 types d'objet.

source: The compliance module name
fr: Le nom du module de conformité

source: The filters view allow compliance administrators to create complex filtersets to limit the ruleset scope to a specific node cursor. All fields from the node asset table can be combined.
fr: La vue des filtres permet aux administrateurs de concevoir les jeux de filtres complexes pour limiter le périmètre de visibilité des jeux de règles à un ensemble de serveurs spécifique. Tous les champs de la vue des noeuds peuvent servir à la modélisation des jeux de filtres.

source: The module action run date on the node.
fr: L'horodatage de l'exécution du module sur le noeud.

source: The module action run status. Can be 'ok' (0), 'not ok' (1) or 'not applicable' (2).
fr: L'état de conformité renvoyé par le module. Peut prendre les valeurs 'ok' (0), 'nok' (1), 'non applicable' (2).

source: The module action which returned the logged status. Always 'check' in this view.
fr: L'action demandée au module. Toujours 'check' dans cette vue.

source: The module action which returned the logged status. Can be 'check', 'fixable' or 'fix'.
fr: L'action demandée au module. Peut être 'chack', 'fixable' ou 'fix'.

source: The module check run status. Can be 'ok' (0), 'not ok' (1) or 'not applicable' (2).
fr: L'état de conformité renvoyé par le module. Peut prendre les valeurs 'ok' (0), 'nok' (1), 'non applicable' (2).

source: The module name.
fr: Le nom du module.

source: The module run date on the node.
fr: L'horodatage de l'exécution du module.

source: The modules view allow compliance administrators to group modules into modulesets. The modulesets can then be attached to nodes through the nodemgr command line::
fr: La vue des modules permet aux administrateurs de la conformité de grouper les modules en jeux de modules. Les jeux de modules peuvent ensuite être attachés aux noeuds par l'interface du collecteur ou par la commande ::

source: The new ruleset now appears in the ruleset list, ready to receive variables.
fr: Le nouveau jeu de règle apparaît maintenant dans la liste des jeux de règles, prêt à recevoir des variables.

source: The node name.
fr: Le nom du noeud.

source: The number of modules checked for this service.
fr: Le nombre de modules vérifiés pour ce service.

source: The number of modules passing compliance checks.
fr: Le nombre de services ayant réussi les tests de conformité du module.

source: The number of modules passing the compliance checks for this service.
fr: Le nombre de modules ayant réussi les tests de conformité pour ce service.

source: The number of modules run on the node.
fr: Le nombre de modules ayant tourné sur ce noeud.

source: The number of nodes checked by this module.
fr: Le nombre de noeuds vérifés par ce module.

source: The number of nodes passing the compliance checks of the module.
fr: Le nombre de noeuds ayant réussi les test de conformité du module.

source: The output of the compliance module for the run.
fr: La sortie du module de conformité pour cette exécution.

source: The service name.
fr: Le nom du service.

source: This facility is offered by the bottom tables of the ruleset view. The table filters are useful to select the nodes efficiently.
fr: Cette fonctionnalité est apportée par les tables de l'outil 'Attachement jeux de règles/noeuds'. L'utilisation du filtrage permet de sélectionner efficacement les noeuds auxquels attacher les jeux de règles.

source: This panel present the compliant/not-compliant status aggregated by module.
fr: Cet encart affiche les états de conformité aggrégé par module.

source: This panel present the compliant/not-compliant status aggregated by node.
fr: Cet encart affiche les états de conformité aggrégé par noeud.

source: This panel present the compliant/not-compliant status aggregated by service.
fr: Cet encart affiche les états de conformité aggrégé par service.

source: This panel present the compliant/not-compliant status without aggregation. It can be used to filter the dataset aggregated in the above panels.
fr: Cet encart affiche les états de conformité sans aucune aggrégation. Il est utile pour filtrer les données qui sont aggrégées dans les encarts du haut de paje.

source: This sub-view has 4 stacked panels. The top 3 are folded upon page load.
fr: Cette vue embarque 4 panneaux. Les trois supérieurs sont repliés par défaut au chargement de la paje.

source: This sub-view presents raw logs of the compliance modules runs on every nodes. It can be used to analyze failure patterns.
fr: Cette vue présente les journaux bruts des exécutions de modules de conformité sur tous les noeuds. Elle est utile à l'analyse des récurrences de problème.

source: Upon grouping, the designer must choose a ``AND`` or ``OR`` logical operator and the components ordering
fr: Lors d'un regroupement, le designer doit choisir entre les opérateurs ``AND`` et ``OR`` et doit choisir l'ordre de prise en compte des membres.

source: Use auditable scripts to apply changes to your hosts
fr: Utilisation de scripts auditable pour prendre en charge tout changement de configuration sur les serveurs

source: Week over week plot of ok/not ok/not applicable status returned by modules for the node. The plotted status are the worst case in the week, meaning if a module returned 'not ok' then 'ok' during week 50, only 'not ok' will be accounted.
fr: Courbe représentant l'évolution semaine après semaine les états de conformité renvoyés par les modules du serveur. Les états pris en compte sont les états "au pire", c'est-à-dire que si un module dans la même semaine a renvoyé un état non ok et un état ok, c'est l'état non ok qui est pris en compte.

source: Week over week plot of ok/not ok/not applicable status returned by modules for the service. The plotted status are the worst case in the week, meaning if a module returned 'not ok' then 'ok' during week 50, only 'not ok' will be accounted.
fr: Courbe représentant l'évolution semaine après semaine les états de conformité renvoyés par les modules du service. Les états pris en compte sont les états "au pire", c'est-à-dire que si un module dans la même semaine a renvoyé un état non ok et un état ok, c'est l'état non ok qui est pris en compte.

source: filter1: 'nodes.os_name = HP-UX'
fr: filtre1 : 'nodes.os_name = HP-UX'

source: filter2: 'nodes.os_name = Linux'
fr: filtre2 : 'nodes.os_name = Linux'

source: filter3: 'nodes.team_responsible = SOMETEAM'
fr: filtre3 : 'nodes.team_responsible = MonEquipe'

source: filterset1: filter1 OR filter2
fr: filterset1 : filtre1 OR filtre2

source: filterset2: filterset1 AND filter3
fr: filterset2 : filterset1 AND filtre3
