Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/contribute.po
Languages: fr

source: Clone the appropriate git repository
fr: Cloner le dépôt git approprié

source: Configured local MTA, with git send-email
fr: MTA local configuré, avec git send-email

source: Configured local MTA, without git send-email
fr: MTA local configuré, sans git send-email

source: Contribute
fr: Contribution

source: Install :command:`git-send-email`, and :command:`msmtp` if you have to use Gmail SMTP (no local MTA configured)::
fr: Installer la commande :command:`git-send-email`, ainsi que :command:`msmtp` si vous souhaitez utiliser le service SMTP de Gmail (sans MTA local configuré) ::

source: Install :command:`git-send-email`::
fr: Installer la commande :command:`git-send-email` ::

source: Install :command:`msmtp` if you have to use Gmail SMTP (no local MTA configured)::
fr: Installer la commande :command:`msmtp` si vous souhaitez utiliser le service SMTP de Gmail (sans MTA local configuré) ::

source: Install git
fr: Installer git

source: OpenSVC projects are tracked with the git source tracker. The documentation is also managed as a git tracked project. A GitWeb interface is available at http://git.opensvc.com.
fr: Les projets de OpenSVC sont traqués par le gestionnaire de sources git. La documentation est également traquée ainsi. Une interface gitweb est disponible sur http://git.opensvc.com.

source: Send patch with::
fr: L'envoi d'un patch se fait par ::

source: Send patches
fr: Envoi de patches

source: Send patches with::
fr: L'envoi de patchs se fait par ::

source: Set up :command:`git-send-email` to use :command:`msmtp`::
fr: Configurer :command:`git-send-email` pour l'utilisation de :command:`msmtp` ::

source: Set up :command:`msmtp`::
fr: Configuration de :command:`msmtp` ::

source: With msmtp, with git send-email
fr: Avec msmtp, avec git send-email

source: With msmtp, without git send-email
fr: Avec msmtp, sans git send-email
