Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/howto.lxc.po
Languages: fr

source: Additional packages
fr: Paquets additionels

source: And opensvc from http://repo.opensvc.com/deb/
fr: Et OpenSVC depuis http://repo.opensvc.com/deb/

source: Basic container setup
fr: Configuration de base d'un container

source: Before moving on to the next step, you should have a couple of servers delivered by OVH, setup with Debian Squeeze, which has initscripts and kernel adapted for LXC. You should also have an 'IP failover' available. Finally, the OpenSVC agent should be installed on both nodes (doc)
fr: Avant de passer à l'étape suivante, vous devez avoir un couple de serveurs mis à disposition par OVH, configurés en Debian Squeeze, avec leur noyau et leur lanceurs supportant LXC. Vous devez également avoir alloué une 'IP failover'. Enfin, l'agent OpenSVC doit être installé sur les deux noeuds (doc)

source: Cgroup setup
fr: Configuration de cgroup

source: Container creation
fr: Création du container

source: Create a backend bridge connected to a dummy interface. In ``/etc/network/interfaces`` add the following block and activate the bridge using ifup br0::
fr: Créer un bridge sans interface physique, seulement connecté à une interface de type dummy. Dans ``/etc/network/interfaces`` ajouter le block suivant et activer le bridge par la commande :command:`ifup br0` ::

source: Create the container
fr: Créer le container

source: Create the container rootfs::
fr: Créer le système de fichier racine du container ::

source: Create the service configuration file::
fr: Créer le fichier de configuration du service ::

source: Disk setup
fr: Configuration des disques

source: Ethernet bridge
fr: Bridge ethernet

source: In ``/etc/fstab`` add the following line::
fr: Dans ``/etc/fstab`` ajouter la ligne suivante ::

source: In ``/etc/sysctl.conf`` set the following parameters and reload the configuration using ``sysctl -p``::
fr: Dans ``/etc/sysctl.conf`` positionner les paramètres suivants et recharger la configuration en utilisant :command:`sysctl -p` ::

source: Install::
fr: Installer ::

source: Kernel parameters
fr: Paramètres noyau

source: Lxc clustered services on OVH
fr: Services Lxc clusterisés sur OVH

source: Make sure this last script is owned by ``root`` and has ``700`` permissions, as it contains important credentials.
fr: S'assurer que ce dernier script est propriété de ``root`` et qu'il a les permissions ``700``, puisqu'il contient des informations sensibles du point de vue de la sécurité.

source: OVH provides powerful internet-connected servers at an affordable price and a scriptable IPv4 takeover. This is a great combination for clustered services driven by opensvc. This cookbook explains the steps involved in integrating such a cluster with LXC services on a local disk to gain a decent partitioning between services without compromise on performance and memory usage.
fr: OVH propose des serveurs puissants et raccordés à internet pour une somme modique, et un mécanisme de bascule des IPv4. C'est une combinaison très intéressante pour les services clusterisés par OpenSVC. Ce guide explique les étapes nécessaires à l'intégration d'un tel cluster, avec des services de type LXC sur disques locaux. Ce type de services permet une bonne isolation entre services sans compromis sur les performance et la consommation de mémoire.

source: OVH routing and ipfailover
fr: Routage OVH et bascule d'ip

source: OVH servers come with a 4 GB root filesystem, a ~4 GB swap partition and the rest of the disk is allocated to /home. The /home filesystem can be replaced by a single physical volume. Create a volume group over this pv and one or a set of logical volumes for each container. Format the logical volumes using the filesystem that suits you. Mount the logical volume set of the first container to create::
fr: Les serveurs OVH sont livrés avec un système de fichiers root de 4 Go, une partition de swap de 4 Go et le reste du disque est alloué à /home. Le système de fichiers /home peut être remplacé par un unique volume physique LVM2. Auquel cas, créer un vg sur ce pv et au moins un lv pour chaque container. Formatter les lv avec le format de système de fichiers qui vous convient. Mounter les systèmes de fichiers du premier container ::

source: Opensvc service creation
fr: Création du service OpenSVC

source: Prepare the lxc container creation wrapper::
fr: Préparer le script d'installation du container lxc ::

source: Preparing a node
fr: Préparation du noeud

source: Preparing the service
fr: Préparation du service

source: Start the container::
fr: Démarrage du container ::

source: Then::
fr: Puis ::

source: Trust the node root account to ssh-login into the container::
fr: Autoriser le compte root du noeud à accéder en ssh au container ::

source: and ``/opt/opensvc/etc/opt/opensvc_name.dir/ipfailover``::
fr: et ``/opt/opensvc/etc/opt/opensvc_name.dir/ipfailover`` ::

source: and create the container with::
fr: puis créer le container avec ::

source: create a lxc config file as ``/tmp/lxc.conf`` containing::
fr: créer un fichier de configuration de container lxc ``/tmp/lxc.conf`` contenant ::

source: create and adapt the trigger scripts as ``/opt/opensvc/etc/opt/opensvc_name.dir/ovh_routes``::
fr: créer et adapter le script de déclencheur ``/opt/opensvc/etc/opt/opensvc_name.dir/ovh_routes`` ::

source: create the trigger scripts store, which is synchronized across nodes::
fr: créer le répertoire qui va héberger les scripts des déclencheurs, qui sera synchronisé entre les noeuds ::

source: network
fr: réseau

source: rc.sysinit (remove swaps and udev actions)
fr: rc.sysinit (retirer les actions sur le swap et udev)
