Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/howto.vmencap.po
Languages: fr

source: **ip resources**
fr: **ressources ip**

source: **vmdg resource**
fr: **ressource vmdg**

source: *and* execute in the context of the guest operating system a command verifying the plumbing on the 'ipdev' adapter.
fr: *et* exécute dans le contexte du système d'exploitation invité une commande vérifiant la présence de l'adresse internet sur la carte 'ipdev'.

source: *and* the disks are dedicated to the service
fr: *et* les disques sont dédiés au service

source: *and* the disks support the scsi3 persistent reservation commands
fr: *et* les disques supportent les commandes de réservation persistante scsi3

source: Add this resource configlet if you pass-through block devices not handled by a volume manager to the virtual machine. The 'vmdg' resource is a special kind of 'vg' resource whose disklist is obtained from the virtual machine configuration. 'start' and 'stop' OpenSVC commands are reduced to scsi reservation handling for this resource as the necessary operations are taken care of by the hypervisor software. It is also necessary for disk inventory completeness.
fr: Ajoutez cette bribe de configuration de ressource si les disques sont donnés tels quels en gestion à la machine virtuelle. La ressource 'vmdg' est un cas particulier de ressource 'vg' dont la liste des disques est obtenue par inspection de la configuration de la machine virtuelle. Les commandes OpenSVC 'start' et 'stop' y sont réduites à la gestion des réservations scsi puisque le reste est pris en charge par le logiciel de virtualisation. Cet inventaire est également utilisé pour la complétude de l'inventaire des disques.

source: All OpenSVC VM drivers except 'zone' leave the ip plumbing to the guest operating system. The ip resources described in the env file are used to check the resource availability. This checks are:
fr: Tous les pilotes de VM de OpenSVC, excepté 'zone', délèguent le montage des adresses internet au système d'exploitation de la VM. Les configurations de ressources ip dans le fichier env des services ont pour but la vérification de la santé du service. Ces vérifications sont :

source: Benefit from all the OpenSVC data replication modes
fr: Bénéfice des pilotes de réplication de données de OpenSVC

source: Configure some ssh key trusts
fr: Configurer les autorisations de clé ssh

source: Customize the service env file
fr: Configurer le fichier env du service

source: Follow the :ref:`agent.install` guide.
fr: Suivre le guide :ref:`agent.install`.

source: Follow the :ref:`agent.service.creation` guide.
fr: Suivre le guide :ref:`agent.service.creation`.

source: If this parameter is not set, the VM name defaults to the service name. When encapsulating an existing VM, chances are that you need to set it to the existing VM hostname. This name is used by the hypervisor to communicate with the VM, so you might need to use a fully qualified name if the hypersisor and the VM do not share the same DNS domain. Communication with zones use the zlogin utility, so fqdn are never needed in this case.
fr: Si ce paramètre n'est pas configuré, le nom de la VM prend pour valeur le nom du service. Quand la VM encapsulée est déjà existante, il est probable qu'il soit nécessaire d'utiliser ce paramètre pour s'adapter au nom de la VM certainement différent du nom du service. Ce nom est utilisé par l'hyperviseur pour communiquer avec la VM. Il est donc possible qu'il soit nécessaire de passer un nom complètement qualifié si le resolver de l'hyperviseur n'est pas paramétré pour chercher dans le domaine de la VM. Les communications avec les zones se font par zlogin, donc les noms complètement qualifiés ne sont jamais nécessaires dans ce contexte.

source: Install a package
fr: Installer un paquet

source: Managing VM as services has many advantages:
fr: La gestion des VM en tant que service OpenSVC amène de nombreux avantages :

source: Mix virtualized and non-virtualized services on the same hosts without increasing complexity (except xen, ldom, esx)
fr: Mélange de service virtualisés et non-virtualisés sur un même hôte sans accroîssement de la complexité (excepté xen, ldom, esx)

source: Nodeware installation
fr: Installation de l'agent

source: OpenSVC deployment on an existing hypervisor is a straight-forward process which does not require service disruption. This cookbook details the steps involved:
fr: L'installation de OpenSVC sur un hyperviseur existant est un processus trivial qui ne requiert pas d'arrêt de service. Ce guide détaille les étapes de ce processus :

source: OpenSVC use ssh as root to execute commands in the other hypervisors context. Such commands are limited to:
fr: OpenSVC utilise ssh en tant que root pour exécuter des commandes sur les autres hyperviseurs. Ces commandes se limitent à :

source: Populate the application startup scripts directory
fr: Populer le répertoire des lanceurs applicatifs

source: Seemless integration of hypervisors in the disaster recovery plan
fr: Intégration transparente des hyperviseurs au plan de reprise d'activité unifié par OpenSVC

source: Service creation
fr: Création du service

source: Set this parameter to true if:
fr: Positionner ce paramètre à true si :

source: Set to the hypervisor where the virtual machine should run in a disaster recovery situation.
fr: Positionner au nom de l'hyperviseur où la machine virtuelle doit tourner en cas de plan de reprise d'activité.

source: Set to the hypervisor where the virtual machine should run in a normal situation.
fr: Positionner au nom de l'hyperviseur où la machine virtuelle doit tourner en mode nominal.

source: Set to the list of hypervisors able to run the virtual machine in a normal situation.
fr: La liste des hyperviseurs habilités à faire tourner la machine virtuelle en situation nominale.

source: Set to the list of hypervisors where the virtual machine may run in a disaster recovery situation.
fr: La liste des hyperviseurs habilités à faire tourner la machine virtuelle en situation de plan de reprise d'activité.

source: Setup a node configuration file (single word)
fr: Configurer le fichier configuration du noeud (un mot)

source: Setup a service configuration file (~15 lines)
fr: Configurer le fichier env du service (~15 lignes)

source: This step does not apply to zones, as zlogin is always trusted. Other drivers use ssh as root to execute commands in the guest context. Such commands are limited to:
fr: Cette étape ne s'applique pas aux zones, puisque zlogin est toujours autorisé. Les autres pilotes utilisent ssh en tant que root pour exécuter des commandes dans le contexte de la machine virtuelle. Ces commandes se limitent à :

source: Trust the hypervisor-to-guest ssh root sessions
fr: Autoriser les communications ssh en tant que root entre les hyperviseurs et l'invité

source: Trust the hypervisor-to-hypervisor ssh root sessions
fr: Autoriser les communications ssh en tant que root entre les hyperviseurs

source: VM encapsulation in a service
fr: Encapsulation d'une VM dans un service

source: application start-up scripts execution in the context of the guest
fr: exécution des lanceurs applicatifs dans le contexte de l'invité

source: ip resources health checking
fr: vérification de la santé des ressources ip

source: remote host mode checking
fr: vérification du host_mode distant

source: remote host replication target mount point checking
fr: vérification des montages des systèmes de fichiers cibles des réplications de données

source: the disks are shared amongst hypervisors
fr: les disques sont partagés entre les hyperviseurs
