Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/howto.ha.po
Languages: fr

source: '-a': add open-ha service
fr: '-a': ajouter un service open-ha

source: A subset of the service's resources can be flagged for monitoring through::
fr: Un sous-ensemble de ressources d'un service peut être marquée pour la surveillance par ::

source: AND one or more monitored resources report a not up status
fr: ET une ou plusieurs ressources surveillées remontent un état non up

source: AND the heartbeat resource reports up status
fr: ET la ressource heartbeat remonte un état up

source: Add services
fr: Ajouter des services

source: Best practice for heartbeat infrastructure:
fr: Bonnes pratiques pour l'infrastructure de heartbeat :

source: Crash the node
fr: Crasher le noeud

source: Create an additional symlink in :file:`/opt/opensvc/etc/`:
fr: Créer un lien symbolique additionel dans :file:`/opt/opensvc/etc/` :

source: Declare a heartbeat resource in the env file: (Refer to :file:`/opt/opensvc/usr/share/doc/template.env` for detailled syntax information).
fr: Déclarer une ressource heartbeat dans le fichier env (se référer à :file:`/opt/opensvc/usr/share/doc/template.env` pour les informations détaillées sur la syntaxe) :

source: Describe cluster nodes
fr: Lister les noeuds du cluster

source: Describe heartbeat paths
fr: Lister les chemins de heartbeat

source: Display the service cluster status::
fr: Affiche l'état du service en cluster ::

source: Don't use LANs with a common point of failure
fr: Ne pas utiliser des réseaux partageant un SPOF

source: Don't use the same LAN twice for heartbeat
fr: Ne pas utiliser deux fois le même réseau

source: Download open-ha from `here <http://repo.opensvc.com/>`_. The default location of all this program's files is :file:`/usr/local/cluster`. Before using any open-ha commands, you have to setup some environment variables::
fr: Télecharger open-ha depuis http://repo.opensvc.com/. L'emplacement par défaut des fichiers installés est :file:`/usr/local/cluster`. Avant d'utiliser les commandes open-ha, il faut paramétrer ces variables d'environnement ::

source: Each heartbeat end-point has a unique port number. Each heartbeat path has a unique multicast IP. The monitor file can be copied as-is to the other, except when Solaris IPMP is active (more listeners than senders in this case).
fr: Chaque extrèmité du lien de heartbeat a un numéro de port unique. Chaque chemin de heartbeat a une addresse multicast unique. Le fichier monitor peut-être copié à l'identique sur l'autre noeud du cluster, à l'exception des configuration IPMP sous Solaris (dans ce cas, il y a plus de d'émetteur que de récepteurs).

source: Fast reboot the node
fr: Reboot rapide du noeud

source: Flag resources for monitoring
fr: Marquer les ressources pour la surveillance

source: High Availabity setup
fr: Configuration de haute disponibilité

source: Ilo stonith driver
fr: Pilote de stonith Ilo

source: In addition to the above instructions, services handled by a clusterware have to:
fr: En plus des instructions ci-dessus, les services gérés par un automate cluster doivent :

source: In file :file:`/usr/local/cluster/conf/nodes`::
fr: Dans le fichier :file:`/usr/local/cluster/conf/nodes`::

source: In service configuration file::
fr: Dans le fichier de configuration du service ::

source: Make sure the heartbeat daemons are setup for startup at boot. If not, depending on your system, apply some commands simalar to::
fr: S'assurer que les daemons de heartbeat sont configurés pour démarrer au boot. Si ce n'est pas le cas, et en fonction du système d'exploitation, passer les commandes équivallentes à ::

source: Monitor action
fr: Action monitor

source: No trailing spaces. One node per line. All members of this cluster must be listed.
fr: Pas de blancs en tête de mot. Un noeud par ligne. Tous les membres du cluster doivent être listés.

source: OpenHA service names are limited to 15 characters and node names are limited to 127 characters.
fr: Les noms de service OpenHA sont limités à 15 caractères et les noms des noeuds sont limités à 127 caractères.

source: Querying
fr: Interrogation

source: Resource monitoring
fr: Surveillance des ressources

source: Resource monitoring can be setup to trigger a service failover upon service resource failure: in other words, a TOC, short for Transfer Of Control. Client-side service ip adresses and data hosting filesystems are typical monitored resources.
fr: La surveillance des ressources peut être configurée pour déclencher la bascule du service lors d'une panne d'une des ressources : en d'autres termes, un TOC, acronyme de Transfer Of Control. Typiquement, les ressources surveillées sont les ip utilisées par les clients et les systèmes de fichier.

source: Schedule resource monitoring
fr: Planification de la surveillance des ressources

source: Service states
fr: Etats du service

source: Setup
fr: Configuration

source: Some Ilo firmware versions refuse rsa authentication. To be on the safe side, use dsa keys. You may also be required to remove change the key comment to match the ILo login username.
fr: Certaines version du firmware Ilo refusent l'autentification rsa. Pour s'assurer les meilleures chances de succès, utiliser des clés dsa. Il peut également être requis de changer le champ commentaire des clés pour qu'il corresponde au nom de l'utilisateur Ilo.

source: Starting the ezha init script will spawn the following daemons:
fr: Le démarrage du lanceur ezha va lancer les daemons suivants :

source: Startup
fr: Démarrage

source: State
fr: Etat

source: Stonith methods are implemented as resource drivers.
fr: Les méthodes de stonith sont implémentés sous forme de ressources.

source: Tell the OpenHA heartbeat to tear down the service and jump to FROZEN_STOP state
fr: Indique au heartbeat OpenHA de stopper le service et de passer son état à FROZEN_STOP

source: The Ilo stonith driver uses key-based ssh authentication. The specific key can be pointed by the following configuration in :file:`etc/auth.conf`::
fr: Le pilote de stonith Ilo utilise l'autentification par clé ssh. Une clé spécifique peut être pointée par la configuration suivante dans :file:`etc/auth.conf` ::

source: The ``DEFAULT.monitor_action`` can be either:
fr: ``DEFAULT.monitor_action`` peut prendre les valeurs suivantes :

source: The ``resource_monitor`` action must be scheduled. For example in :file:`/etc/cron.d/opensvc`::
fr: L'action ``resource_monitor`` doit être planifiée. Par exemple dans :file:`/etc/cron.d/opensvc` ::

source: The ``resource_monitor`` service action triggers the ``DEFAULT.monitor_action`` if:
fr: L'action de service ``resource_monitor`` déclencle ``DEFAULT.monitor_action`` dans les conditions suivantes :

source: The stonith action returns 1 to abort the switch-over, 0 otherwise.
fr: L'action stonith retourne 1 pour annuler la bascule, 0 sinon.

source: The stonith mecanism is triggered by executing :file:`etc/svcname.stonith`. OpenHA can be configured to stonith by setting :file:`etc/svcname.stonith` as a check-up script.
fr: Le mécanisme de stonith est déclenché en exécutant :file:`etc/svcname.stonith`. OpenHA peut être configuré pour déclencher un stonith en déclarant :file:`etc/svcname.stonith` en tant que check-up script.

source: The stonith mecanism is used to arbitrate split-brain situations, where nodes can't see each other and they can't determine if they can safely take over the service. In such situation a node will power cycle it's peer to be sure only one node has the service responsability at a time.
fr: Le mécanisme de stonith est utilisé pour arbitrer les situations de schizophrénie du cluster, où les noeuds ne se voient plus et qu'ils ne peuvent déterminer si ils peuvent s'approprier le service en toute sécurité. Dans un telle situation, un noeud va couper le courrant de son pair pour être sûr que lui seul aura la responsabilité du service.

source: Then run::
fr: Puis lancer ::

source: This cookbook focuses on adding HA to an existing OpenSVC clustered service. Please refer to:
fr: Ce guide se concentre sur l'ajout de la configuration HA à un service OpenSVC existant. Vous pouvez vous référer à :

source: This cookbook presents the steps to setup an automated OpenSVC service failover using open-ha for the heartbeat. open-ha is our preferred heartbeat daemon because it runs on all Unix operating systems, proposes multiple multicast heartbeat paths using a mix of IP and SCSI, and has a flexible trigger support.
fr: Ce guide présente les étapes nécessaires pour configurer une bascule automatique de service OpenSVC en utilisant OpenHA pour heartbeat. OpenHA est notre daemon heartbeat de référence car il tourne sur tous les systèmes Unix, propose plusieurs chemins de heartbeat réseau multicast ou SCSI, et implémente un système de déclencheurs souple.

source: To setup 3 multicast heartbeats, in file :file:`/usr/local/cluster/conf/monitor`::
fr: Pour configurer 3 heartbeats multicast, dans le fichier :file:`/usr/local/cluster/conf/monitor` ::

source: Trigger a failover
fr: Déclenchement d'une bascule

source: Try to configure an even number of heartbeats
fr: De préférence, configurer un nombre impair de heartbeats

source: Try to configure one heartbeat on a dedicated LAN
fr: De préférence, configurer un heartbeat sur un LAN dédié

source: Use
fr: Utilisez

source: When a service is handled to any heartbeat daemon, you must not use stop/start OpenSVC commands to drive this service: the heartbeat daemon being in charge, you must use its command set only. On the node where the service is RUNNING::
fr: Quand un service est donné en gestion à un daemon de heartbeat, il ne faut plus utiliser les commandes OpenSVC stop/start directement pour piloter le service : Le daemon de heartbeat, en tant que gestionnaire, offre ses propres commandes de pilotage. Sur le noeud où le service est RUNNING ::

source: Where:
fr: Où :

source: With STONITH::
fr: Avec STONITH ::

source: Without STONITH::
fr: Sans STONITH ::

source: `Nodeware installation <agent.install.html>`_
fr: `Installation de l'agent <agent.install.html>`_

source: `Service creation <agent.service.creation.html>`_
fr: `Création du service <agent.service.creation.html>`_

source: last run of the opensvc service shutdown command is pending completion.
fr: la dernière tentative d'arrêt du service est toujours en cours d'exécution.

source: last run of the opensvc service shutdown command returned some error. open-ha restrains from running further service commands.
fr: la dernière tentative d'arrêt du service a renvoyé une erreur. open-ha empêche toute nouvelle commande sur le service.

source: last run of the opensvc service shutdown command returned successfully.
fr: la dernière tentative d'arrêt du service s'est terminée en succès.

source: last run of the opensvc service startup command is pending completion.
fr: la dernière tentative de démarrage du service est toujours en cours d'exécution.

source: last run of the opensvc service startup command returned some error. open-ha restrains from running further service commands.
fr: la dernière tentative de démarrage du service a renvoyé une erreur. open-ha empêche toute nouvelle commande sur le service.

source: last run of the opensvc service startup command returned successfully.
fr: la dernière tentative de démarrage du service s'est terminée en succès.

source: multicast listener daemons, one per local heartbeat receiving end-point
fr: daemon de réception des paquets multicast, un par chemin de heartbeat multicast

source: multicast sender daemons, one per local heartbeat sending end-point
fr: daemon d'émission des paquets multicast, un par chemin de heartbeat multicast

source: node is ready to take over the service.
fr: le noeud est prêt à reprendre le service.

source: param#1: node hostname
fr: param#1: nom d'hôte du noeud

source: param#1: service name, align to OpenSVC is not required, advised anyway
fr: param#1: nom du service, pas nécessairement aligné sur le nom du service OpenSVC, mais recommandé

source: param#2: heartbeat type
fr: param#2: type de heartbeat

source: param#2: primary node
fr: param#2: noeud primaire

source: param#3: multicast IP
fr: param#3: ip multicast

source: param#3: secondary node
fr: param#3: noeud secondaire

source: param#4: port number
fr: param#4: numéro de port

source: param#4: service init script
fr: param#4: lanceur du service

source: param#5: heartbeat period
fr: param#5: période du heartbeat

source: state reached after a successful 'freeze-stop' open-ha command. open-ha restrains from running further service commands.
fr: état atteint à la suite d'une commande open-ha 'freeze-stop'. open-ha empêche de passer des commandes sur le service par la suite.

source: state reached after freezing through open-ha a stopped service. open-ha restrains from running further service commands.
fr: état atteint après avec gelé un service open-ha en état STOPPED. open-ha empêche de passer des commandes sur le service par la suite.

source: state transition and trigger initiator daemon
fr: transitionne l'état et déclenche le daemon initiateur

source: the service has a heartbeat resource
fr: le service possède une ressource heartbeat
