Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/howto.nfsha.po
Languages: fr

source: **On both nodes**
fr: **Sur les deux noeuds**

source: **On both nodes**::
fr: **Sur les deux noeuds** ::

source: **On the master node**::
fr: **Sur le noeud maître** ::

source: Change these system configuration files to use this new mountpoint.
fr: Changer ces fichiers de configurations du système pour utiliser ces nouveaux points d'ancrage.

source: Configure nfs to listen on the service IP address
fr: Configurer nfs pour écouter sur l'adresse internet du service

source: Create a HA service, using the :ref:`howto.ha` howto.
fr: Créer un service HA, en utilisant le guide :ref:`howto.ha`.

source: Create the OpenSVC service startup script.
fr: Créer le lanceur du service OpenSVC.

source: Create the new mount point.
fr: Créer le nouveau point d'ancrage.

source: Epilog
fr: Epilogue

source: Linux NFS service uses ``/var/lib/nfs`` to store both node-private and service-private data. The tricky part of the HA setup is to separate this data.
fr: Le service NFS sous Linux utilise ``/var/lib/nfs`` pour stocker à la fois les méta-données privées au noeud et celles qui doivent basculer. La complexité dans la mise en haute disponibilité est de séparer ces deux types de données.

source: Make sure the ``/opt/opensvc/nfssvc.d`` symlink points to a directory hosted on a shared filesystem, handled by the nfssvc OpenSVC service. This howto uses ``/nfssvc`` as the root service shared filesystem.
fr: S'assurer que le lien symbolique ``/opt/opensvc/nfssvc.d`` pointe sur un répertoire d'un système de fichiers basculable, pris en charge par le service OpenSVC nfssvc. Ce guide utilise ``/nfssvc`` comme racine de ce système de fichier basculable.

source: Modify STATD_HOSTNAME in /etc/sysconfig/nfs
fr: Modifier STATD_HOSTNAME dans /etc/sysconfig/nfs

source: NFS High Availability setup
fr: NFS en haute disponibilité

source: NFS configuration
fr: Configuration NFS

source: NFS is a tricky beast to setup for high availability. Without proper configuration NFS clients tend to hang waiting for i/o completion on the shares. This guide exposes the Linux NFS servers configuration for smooth failover.
fr: NFS est un service délicat à mettre en haute disponibilité. Sans configuration soigneuse, les clients NFS ont tendance à se figer en attente d'un aquittement d'entrée/sortie sur le partage. Ce guide expose la configuration adéquate pour une bascule transparente du service NFS sous Linux.

source: NFS server startup
fr: Démarrage du serveur NFS

source: NFS startup will be handled by the OpenSVC service. Stop the NFS service and inhibit its launch at server startup.
fr: Le démarrage du service NFS sera pris en charge par le service OpenSVC. Il faut donc arrêter le service NFS et inhiber son démarrage au boot des serveurs.

source: Node private data
fr: Données propres aux noeuds

source: OpenSVC HA setup
fr: Configuration HA pour OpenSVC

source: Reboot the nodes to activate the new ``rpc_pipefs`` location and start testing failovers.
fr: Rebooter les noeuds pour activer l'utilisation du nouvel emplacement de ``rpc_pipefs`` et commencer à tester des bascules.

source: Service private data
fr: Données propres au service

source: The data that must remain local to each node is the RPC pipefs pseudo filesystem. It is mounted by default under ``/var/lib/nfs/rpc_pipefs``. As ``/var/lib/nfs`` will be moved to the shared filesystem, we need to change the location of this mount point.
fr: Les données qui doivent rester locales aux noeuds sont contenues dans le pseudo système de fichiers RPC pipefs. Sont point d'ancrage par défaut est ``/var/lib/nfs/rpc_pipefs``. Comme ``/var/lib/nfs`` doit être déplacé dans l'arborescence du système de fichier basculable, il faut changer l'emplacement de ce point d'ancrage.

source: The exports list should also move with the service, to avoid configuration drift between the 2 nodes.
fr: La liste des exports devrait également se déplacer avec le service, pour éviter une dérive de configuration entre les deux noeuds.

source: ``/var/lib/nfs`` contains data essential for nfs client sessions takeover. Thus, this directory must follow the service in case of failover.
fr: ``/var/lib/nfs`` contient des données essentielles pour la reprise des sessions clientes. C'est pourquoi ce répertoire doit suivre le service en cas de bascule.
