Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/man.svcmgr.po
Languages: fr

source: Collector management
fr: Gestion du collecteur

source: Compliance
fr: Conformité

source: Copyright © 2012 OpenSVC SARL. License GPLv2: GNU GPL version 2 <http://gnu.org/licenses/gpl.html>. This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
fr: Copyright © 2012 OpenSVC SARL. Licence GPLv2 : GNU GPL version 2 <http://gnu.org/licenses/gpl.html>. Ceci est un logiciel libre : vous êtes libre de le changer et de le redistribuer. Il n'y a aucune garantie, dans la mesure permie par la loi.

source: NAME
fr: NOM

source: OpenSVC homepage: http://www.opensvc.com
fr: Page principale OpenSVC : http://www.opensvc.com

source: REPORTING BUGS
fr: REMONTER DES BUGS

source: Report bugs to opensvc-users@opensvc.com.
fr: Remontez les bugs à opensvc-users@opensvc.com.

source: SEE ALSO
fr: VOIR AUSSI

source: Service actions
fr: Actions de service

source: Service configuration
fr: Configuration de service

source: The svcmgr command controls all OpenSVC concepts relative to services on the local node. Collector querying and alteration of data concerning the node's services, service compliance management, OpenSVC service-specific configuration management, service-relative data push to the collector and service management.
fr: La commande svcmgr contrôle tous les aspects relatifs à la gestion des services sur le noeud local. Interrogation du collecteur, changement des données concernant le service, gestion de la conformité de service, gestion des configurations de service, envoi de données du service au collecteur, gestion des services.

source: a begin date expressed as 'YYYY-MM-DD hh:mm'. used with the 'collector ack unavailability' action
fr: Une date de début exprimée au format 'AAAA-MM-JJ hh:mm'. À utiliser avec les actions 'collector ack' et 'pushstats'.

source: a comment to log when used with the 'collector ack unavailability' action
fr: Un commentaire à enregistrer en complément de l'action 'collector ack unavailabilty'.

source: a duration expressed in minutes. used with the 'collector ack unavailability' action
fr: Une durée exprimée en minutes. À utiliser avec l'action 'collector ack unavailability'.

source: a end date expressed as 'YYYY-MM-DD hh:mm'. used with the 'collector ack unavailability' action
fr: Une date de fin exprimée au format 'AAAA-MM-JJ hh:mm'. À utiliser avec l'action 'collector ack unavailability'.

source: a resource definition in json dictionary format fed to create or update
fr: Une définition de ressource au format dictionnaire sérialisé JSON passée aux actions 'create' ou 'update'

source: acknowledge an action error on the service. an acknowlegment can be completed by --author (defaults to root@nodename) and --comment
fr: Aquitter une action en erreur sur le service. Un aquittement peut être complété par --author (par défaut root@nodename) et --comment.

source: acknowledge an unavailability period. the period is specified by --begin/--end or --begin/--duration. omitting --begin defaults to now. an acknowlegment can be completed by --author (defaults to root@nodename), --account (default to 1) and --comment
fr: Aquitter une période d'indisponibilité. La période est spécifiée par --begin/--end ou --begin/--duration. --begin prend pour défaut l'instant présent. Un aquittement peut être complété par --author (par défaut root@nodename), --account (par défaut 1) et --comment.

source: activate zpool resources of this service
fr: Active les ressources zpool du service.

source: activate/import volume group resources of this service
fr: Active/importe les ressource de type volume group du service

source: attach loop resources of this service
fr: Attache les ressources de type loop du service

source: attach moduleset specified by --moduleset to this service
fr: Attache le jeu de module spécifié par --moduleset à ce service

source: attach ruleset specified by --ruleset to this service
fr: Attache le jeu de règles spécifié par --ruleset à ce service

source: attach the modulesets specified during a compliance check/fix/fixable command
fr: Attache les jeux de modules spécifiés lors d'une commande check/fix/fixable de conformité

source: combo action, activating standby disks, taking reservations, starting loopback devices and volume groups
fr: Action combinée, active les disques, aquiert les réservations scsi, démarre les disques loopback et les volume groups

source: combo action, chaining stop-start
fr: Action combinée, chaîne stop-start

source: combo action, chaining stop-syncresync-start
fr: Action combinée, chaîne stop-syncresync-start

source: combo action, chaining syncnodes-syncdrp-syncupdate. --force bypass the schedule check.
fr: Action combinée, chaîne syncnodes-syncdrp-syncupdate. --force outre-passe la vérification de la planification

source: combo action, stopping volume groups and loopback devices, droping reservations, disabling standby disks
fr: Action combinée, stoppe les volume groups et les disques loopback, restitue les réservations scsi, désactive les disques

source: comma-separated list of resource tags to limit action to
fr: Une liste de tags de ressource, séparés par des virgules, qui limite le périmètre de l'action aux ressources qui ont ces tags

source: comma-separated list of resource to limit action to
fr: Une liste d'identifiants de ressource, qui limite le périmètre de l'action à ces ressources

source: comma-separated list of service to operate on
fr: Une liste de noms de service sur lesquels appliquer l'action

source: command provided to the heartbeat daemon to fence peer node in case of split brain
fr: Commande passée par le daemon de heartbeat pour évincer le noeud du cluster en cas de schizophrénie

source: compliance, set module list
fr: Conformité, définit la liste des modules

source: compliance, set moduleset list. The 'all' value can be used in conjonction with detach.
fr: Conformité, définit la liste des modules. La valeur 'all' peut être utilisée avec l'action 'detach'

source: compliance, set ruleset list. The 'all' value can be used in conjonction with detach.
fr: Conformité, définit la liste de jeux de règles. La valeur 'all' peut être utilisée avec l'action 'detach'

source: compliance, use rulesets valid on specified date
fr: Conformité, utilise les jeux de règles en vigueur à la date spécifiée

source: configure service ip addresses
fr: Configure les adresses internet du service

source: create a new service configuration file. --interactive triggers the interactive mode
fr: Initialise un fichier de configuration pour un nouveau service. --interactive déclenche le mode interactif

source: deactivate zpool resources of this service
fr: Désactive les ressources de type zpool du service

source: deactivate/deport volume group resources of this service
fr: Désactive/déporte les ressources de type volume group du service

source: debug mode
fr: Mode de débug

source: decides that the unavailabity period should be deduced from the service availability anyway. used with the 'collector ack unavailability' action
fr: Indique si la période d'indisponibilité doit être décomptée du taux de disponibilité. A utiliser avec l'action 'collector ack unavailability'

source: delete resources passed through --rid in services passed through --service
fr: Supprime les ressources spécifiées par --rid dans les services spécifiés par --service

source: detach loop resources of this service
fr: Détache les ressources de type loop du service

source: detach moduleset specified by --moduleset from this service
fr: Détache le jeu de modules spécifié par --moduleset de ce service

source: detach ruleset specified by --ruleset from this service
fr: Détache le jeu de règles spécifié par --ruleset de ce service

source: detect monitored resource failures and trigger monitor_action
fr: Evalue les pannes de ressources monitorées et déclenche monitor_action

source: disable resources passed through --rid in services passed through --service. Specifying no resource disables the whole service.
fr: Désactive les ressources spécifiées par --rid dans les services spécifiés par --service. Ne pas spécifier de ressources désactive tout le service.

source: display service alerts
fr: Affiche les alertes du service

source: display service checks
fr: Affiche les sondes du service

source: display service events during the period specified by --begin/--end. --end defaults to now. --begin defaults to 7 days ago
fr: Affiche les évènements durant la période spécifiée par --begin/--end. --end prend pour défaut l'instant. --begin prend pour défaut 7 jours auparavant

source: display service live configuration
fr: Affiche la configuration actuelle du service

source: display service resource status
fr: Affiche l'état des ressources du service

source: display service status on all nodes, according to the collector.
fr: Affiche les états de service sur tous les noeuds, tels que connus du collecteur.

source: enable resources passed through --rid in services passed through --service. Specifying no resource enables the whole service.
fr: Active les ressources spécifiées par --rid dans les services spécifiés par --service. Ne pas spécifier de ressource active tout le service.

source: execute service application startup script
fr: Exécute les lanceurs applicatifs du service

source: execute service application stop script
fr: Exécute les stoppeurs applicatifs du service

source: force action, ignore sanity check warnings
fr: Force l'action, ignore les avertissements

source: get the value of the service configuration parameter pointed by --param
fr: Affiche la valeur du paramètre de configuration de service pointé par --param

source: like syncupdate, but not triggered by the scheduler (thus adapted for clone/snap operations)
fr: Comme syncupdate, mais non déclenché par la planification (donc à utiliser pour les opérations de clone/snap)

source: list acknowledged periods for the service. the periods can be filtered by --begin/--end. omitting --end defaults to now. the wildcartd for --comment and --author is %
fr: Affiche les périodes aquittées du service. Les périodes peuvent être filrées par begin/--end. --end prend pour défaut l'instant. Le caractère joker pour --comment et --author est %

source: list actions on the service, whatever the node, during the period specified by --begin/--end. --end defaults to now. --begin defaults to 7 days ago
fr: Affiche les actions sur le service, quel que soit le noeud, pendant la période spécifiée par --begin/--end. --end prend pour défaut l'instant. --begin prend pour défaut 7 jours auparavant

source: list available compliance modulesets. --moduleset f% limit the scope to modulesets matching the f% pattern.
fr: Liste les jeux de modules disponibles. --moduleset f% limite le périmètre aux jeux de modules correspondants à l'expression f%.

source: list available compliance rulesets. --ruleset f% limit the scope to rulesets matching the f% pattern.
fr: Liste les jeux de règles disponibles. --ruleset f% limite le périmètre aux jeux de règles correspondants à l'expression f%.

source: live migrate the service to the remote node. --to <node> specify the remote node to migrate the service to.
fr: Migre à chaud le service vers un autre noeud. --to <node> spécifie le noeud distant vers lequel migrer le service.

source: make use of files received from master nodes in var
fr: Consomme les fichiers de var/ reçus du noeud maître du service

source: operate only on service flagged for autostart on this node
fr: Limite l'action aux services marqués pour démarrage automatique sur ce noeud (autostart_node)

source: operate only on service in the specified status (up/down/warn)
fr: Limite l'action aux services dans l'état spécifié (up/down/warn)

source: operate only on service not flagged for autostart on this node
fr: Limite l'action aux services non marqués pour démarrage automatique (autostart_node)

source: option to set when excuting from a clusterware to disable safety net
fr: Option à passer pour outre-passer la sécurité sur les services en haute disponibilité

source: point a service configuration parameter for the 'get' and 'set' actions
fr: Pointe un paramètre de configuration de service pour les actions 'get' ou 'set'

source: prepare devices, logical volumes, mount service filesystems, bootstrap containers
fr: Prépare les devices, les volumes logiques, monte les systèmes de fichiers, démarrare les containers

source: print service disk list
fr: Affiche la liste des disques du service

source: prompt user for a choice instead of going for defaults or failing
fr: Demande à l'utilisateur d'arbitrer plutôt que d'utiliser les valeurs par défaut ou d'échouer

source: provide the resource and aggregated status in json format, for use by tier tools
fr: Affiche les états de ressources et les états aggrégés au format dictionnaire sérialisé JSON, utilisable par les outils tiers

source: provide the service disk list in json format, for use by tier tools
fr: Affiche la liste des disques au format dictionnaire sérialisé JSON, utilisable par les outils tiers

source: provision the service in addition to env file creation. defaults to False.
fr: provisionne le service et ses ressources en plus de la création du fichier de configuration du service. Prend pour défaut Faux

source: push service application launchers appinfo key/value pairs to database
fr: Envoie au collecteur les couples clé/valeur du appinfo des lanceurs du service

source: push service configuration to database
fr: Envoie les configurations de service au collecteur

source: re-establish a broken storage hardware-assisted synchronization
fr: Rétablit la synchronisation d'une ressource sync pilotant une replication assistée par le matériel de stockage

source: release scsi disks held by this service
fr: Restitue les réservations persistantes scsi tenues par le service

source: remote node to start or migrate the service to
fr: Le noeud distant vers lequel migrer le service

source: remove the flag to unblock actions on this service
fr: Supprime le témoin d'inhibition des actions sur le service

source: report on the current blocking of actions on this service
fr: Affiche l'état d'inhibition des actions sur le service

source: report status of reservations on scsi disks held by this service
fr: Affiche l'état des réservations persistantes scsi tenues par le service

source: reserve scsi disks held by this service
fr: Aquiert les réservations persistantes scsi du service

source: return service overall status code
fr: Affiche le code numérique d'état général du service

source: run compliance checks. --ruleset <md5> instruct the collector to provide an historical ruleset.
fr: Lance une vérification de conformité. --ruleset <md5> indique au collecteur de fournir un jeu de règles historique.

source: run compliance fixes. --ruleset <md5> instruct the collector to provide an historical ruleset.
fr: Lance une mise en conformité. --ruleset <md5> indique au collecteur de fournir un jeu de règles historique.

source: send to drp nodes the service config files and additional files described in the config file. --force bypass the schedule check.
fr: Envoie aux noeuds de PRA les fichiers de configuration du service et les fichiers additionnels définis dans la configuration de service. --force outre-passe la vérification de la plage autorisée de planification.

source: send to peer nodes the service config files and additional files described in the config file. --force bypass the schedule check.
fr: Envoie aux noeuds pairs les fichiers de configuration du service et les fichiers additionnels définis dans la configuration de service. --force outre-passe la vérification de la plage autorisée de planification.

source: set a service configuration parameter (pointed by --param) value (pointed by --value)
fr: Attribue à un paramètre (pointé par --param) de la configuration de service une valeur (passée par --value).

source: set a service configuration parameter value for the 'set --param' action
fr: Indique la valeur d'un paramètre à attribuer ppour l'action 'set --param'

source: set up a flag to block actions on this service
fr: Installe le témoin d'inhibition des actions sur le service

source: show actions detailled log. a single action is specified by --id. a range is specified by --begin/--end dates. --end defaults to now. --begin defaults to 7 days ago
fr: Affiche la liste détaillée des actions. Une action précise peut être spécifiée par --id. Une période peut être spécifiée par --begin/--end. --end prend pour défaut l'instant présent. --begin prend pour défaut 7 jours auparavant.

source: show compliance modules status
fr: Affiche l'état de conformité des modules

source: show compliance rules applying to this service
fr: Affiche les règles de conformité applicables au service

source: show program's version number and exit
fr: Affiche la version de l'agent

source: show this help message and exit
fr: Affiche ce message d'aide

source: shutdown container, umount service filesystems, deactivate logical volumes
fr: Eteint le container, démonte les systèmes de fichiers, désactive les volumes logiques

source: specify an id to act on
fr: Précise un identifiant pour l'action

source: split a storage hardware-assisted disk synchronization
fr: Casse une réplication assisté par le matériel de stockage

source: start a service if executed on the primary node (or one of the primary nodes in case of a flex service), startstandby if not
fr: Démarre un service si exécuté sur un noeud primaire (ou un des noeuds primaires dans le cas d'un service flex), startstandby sinon

source: start a service, chaining startip-diskstart-startapp
fr: Démarre un service, chaîne startip-diskstart-startapp

source: start actions on specified services in parallel
fr: Déclenche l'action sur les différents services spécifiés en parallèle

source: start service resources marked always_on
fr: Démarre les ressources du service qui sont marquée always_on

source: start the container resource
fr: Démarre la ressource container

source: stop a service, chaining stopapp-stopdisk-stopip
fr: Arrête un service, chaîne stopapp-stopdisk-stopip

source: stop a service, disabling the background database logging
fr: Arrête un service en prenant soin d'envoyer les journaux de façon synchrone

source: stop the container resource
fr: Arrête la ressource container

source: stop the service on the local node and start on the remote node. --to <node> specify the remote node to switch the service to.
fr: Arrête le service sur le noeud local et le démarre sur le noeud distant. --to <node> spécifie le noeud distant vers le lequel le service est migré.

source: svcmgr [options]... command
fr: svcmgr [options]... commande

source: the acker name to log when used with the 'collector ack unavailability' action
fr: Le nom de l'aquitteur à enregistrer lors d'une action 'collector ack unavailability'

source: trigger a full copy of the volume to its target
fr: Déclenche une copie complète d'un volume vers sa cible

source: trigger a one-time checksum-based verify of the volume and its target
fr: Déclenche une vérification basée sur un calcul de somme de contrôle d'un volume et de sa cible

source: trigger a one-time resync of the volume to its target
fr: Déclenche une resynchronisation d'un volume vers sa cible

source: trigger a storage hardware-assisted disk synchronization
fr: Déclenche une resynchronisation assistée par le matériel de stockage

source: unconfigure service ip addresses
fr: Déconfigure les adresses internet du service

source: unset a service configuration parameter pointed by --param
fr: Supprime le paramètre de configuration de service pointé par --param

source: update definitions in an existing service configuration file
fr: Modifie la configuration d'un service existant

source: update var files associated to resources
fr: Met à jour les fichiers de var associés au service

source: used by cron'ed action to tell the collector to treat the log entries as such
fr: Utilisé par les actions planifiées pour indiquer au collecteur que les journaux doivent être marqués comme issus d'actions planifiées

source: verify compliance fixes prerequisites. --ruleset <md5> instruct the collector to provide an historical ruleset.
fr: Vérifie les prérequis aux mises en conformités. --ruleset <md5> indique au collecteur de fournir un jeu de règles historique.
