Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/storage.btrfs.po
Languages: fr

source: A replication action applies the following logic:
fr: L'action de réplication applique la logique suivante :

source: Command set
fr: Commandes

source: Examples
fr: Exemples

source: Extract of a typical btrfs sync env file
fr: Extrait du fichier d'un configuration typique pour la synchronisation via btrfs

source: Full synchronization
fr: Synchronisation complète

source: Implementation details
fr: Détails d'implémentation

source: Incremental synchronization
fr: Synchronisation incrémentale

source: Initial synchronization or incremental synchronisation. First one will be a Initial synchronisation, next will be incremental
fr: Synchronisation initiale ou incrémentale. La première synchronisation est complète, les suivantes incrémentales

source: Internals
fr: Mécanismes internes

source: Introduction
fr: Introdcution

source: Last synchronization occured less than sync_max_delay minutes ago.
fr: La dernière synchronisation a eu lieu il y a moins de sync_max_delay minutes.

source: Last synchronization occured more than sync_max_delay minutes ago.
fr: La dernière synchronisation a eu lieu il y a plus de sync_max_delay minutes.

source: Same
fr: Idem

source: Service configuration
fr: Configuration de service

source: Service configuration file
fr: Fichier de configuration du service

source: Source and targets maintain a btrfs snapshot @sent to identify the last incremental synchronization done properly. This state is used to check that the deltas application sequence is not broken. If broken, alerts are emited and a full sync must be scheduled
fr: La source et la cible maintiennent un snapshot suffixé @sent pour identifier la dernière synchronisation incrémentale réussie. La présence de ce snapshot est utilisée pour savoir si la chaine de synchronisation a été rompue et donc si une synchronisation complète doit être planifiée

source: Status
fr: Etats

source: The btrfs replication scheme is based on btrfs send/receive. OpenSVC uses btrfs snapshots to ensure incremental send/receive replication.
fr: La stratégie de réplication par btrfs est basée sur les commandes btrfs send/receive. OpenSVC utilise les snapshots btrfs pour assurer les réplications incrémentales.

source: There are some shortcomings in the current btrfs send/receive implementation that opensvc works around :
fr: Il existe des lacunes dans l'implémentation actuelle de btrfs send/receive qu'OpenSVC contourne :

source: btrfs data replication
fr: Réplication de données par btrfs

source: btrfs receive is easily confused when looking for a subvol parent id : for now opensvc has to mount the ID5 root vol on ``/opt/opensvc/var/btrfs/<label>`` and uses a flat/root-parented snapshot hosting. Once the btrfs feature matures we might move to a .osvcsnap/ dedicated subvol mounted in ``/opt/opensvc/var/btrfs/<label>.osvcnap/`` instead.
fr: La commande btrfs receive est facilement confuse quand elle vérifie le parent id d'un subvolume : temporairement OpenSVC monte le subvolume d'ID 5 (la racine) sur ``/opt/opensvc/var/btrfs/<label>`` et utilise un plan de nommage des snapshots en arborescence plate à la racine du btrfs. Quand la fonctionnalité sera assez mature dans btrfs, les snapshots résideront dans un subvolume dédié monté dans ``/opt/opensvc/var/btrfs/<label>.osvcnap/``.

source: create @tosent readonly snapshots on sender
fr: Crée le snapshot @tosent en lecture seule sur l'émetteur

source: install the @sent subvol as rw snapshots on remotes
fr: Installe le subvolume @sent sur les récepteurs sous la forme de snapshots en lecture/écriture

source: no recursive snapshot/delete/send : for now you have to declare one sync resource per subvol, even if they are organised as a tree.
fr: Pas de récursivité sur les snapshots/suppressions/envois : pour l'instant il faut déclarer une ressource de synchronisation par subvolume, même s'ils sont organisés en arbre.

source: recursive clean-up of the destination final location on remote
fr: Nettoyage récursif du chemin destination final sur les noeuds distants

source: rotate @tosent to @sent on remote
fr: permute @tosent et @sent sur la cible

source: rotate @tosent to @sent on sender
fr: permute @tosent et @sent sur la source

source: send/receive the @tosent snap
fr: envoie/reçoie le snapshost @tosent
