Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/storage.drbd.po
Languages: fr

source: Command set
fr: Commandes

source: Demote to 'secondary' state
fr: Transition vers le mode 'secondary'

source: Drbd is a Linux kernel driver presenting shared block devices from pairs of local block devices. Replication data goes over the network and can be synchronous ou near-synchronous. It supports the active-active or active-passive operation modes. The former being a prerequisite for cluster filesystem.
fr: Drbd est un pilote du noyau Linux qui présente un block device partagé à partir d'une paire de block devices locaux. La réplication des données se fait par le réseau et peut être synchrone ou quasi-synchrone. Il supporte les modes actif-actif et actif-passif. Le mode actif-actif est un pré-requis pour les systèmes de fichiers en cluster.

source: Drbd storage driver
fr: Pilote Drbd

source: Examples
fr: Exemples

source: Files contributed to sync#i0
fr: Fichiers ajoutés à sync#i0

source: In this example the service drives an OpenVZ container installed in a filesystem (fs#1) build on a drbd (drbd#1, resource name 'data'). OpenSVC Also handles the :file:`svc/etc/init.d/foo` start-up script inside the vz container.
fr: Dans cet exemple, le service pilote un container OpenVZ installé sur un système de fichiers (fs#1) bâti sur un disque drbd (drbd#1, nom de la ressource 'data'). OpenSVC gère aussi le lanceur :file:`svc/etc/init.d/foo` à l'intérieur du container.

source: Node configuration
fr: Configuration des noeuds

source: OpenSVC does not configure the drbd framework. It just handles the actions needed upon service 'start' and 'stop'.
fr: OpenSVC ne prend pas en charge la configuration du sous-système drbd. Il n'assure que le pilotage nécessaire au moment des 'start' et 'stop'.

source: Promote to 'primary' state
fr: Transition vers l'état 'primary'

source: Syntax
fr: Syntaxe

source: The drbd driver is a member of the 'disk group' class.
fr: Le pilote drbd est un membre de la classe 'disk group'.

source: The drbd resource configuration is expected to reside in :file:`/etc/drbd.d/${res}.res`.
fr: La configuration de la ressource drbd est attendue à l'emplacement :file:`/etc/drbd.d/${res}.res`.

source: This file is thus replicated from the node running the service to the other nodes and drpnodes.
fr: Ce fichier est ainsi répliqué depuis le noeud faisant tourner le service vers les noeuds secondaires et de reprise d'activité.

source: Upon service 'start', drbd 'start' is scheduled after volume group 'start'. To use when the the drbd is layered over the volume group.
fr: Lors d'un 'start' du service, l'action 'start' des drbd est planifiée après le 'start' des volume groups. A utiliser quand les block devices socles de drbd sont des volumes logiques.

source: Upon service 'start', drbd 'start' is scheduled before volume group 'start'. To use when the volume group is layered over the drbd.
fr: Lors d'un 'start' du service, l'action 'start' des drbd est planifiée avant le 'start' des volume groups. A utiliser quand les pv des vg sont des devices drbd.
