Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/storage.netapp.po
Languages: fr

source: Acquire read/write access to the snapmirrored resources. Either swapping the syncs direction (in geocluster mode), or breaking-off the syncs (default disaster recovery mode).
fr: Promeut l'accès aux ressources snapmirror en lecture-écriture. Soit par inversion du sens de réplication (en mode geocluster), soit par arrêt des synchronisations (mode classique de plan de reprise d'activité).

source: Append the keys to :file:`/nasprd/vol/vol0/etc/sshd/opensvc/.ssh/authorized_keys2`::
fr: Ajouter les clés au fichier :file:`/nasprd/vol/vol0/etc/sshd/opensvc/.ssh/authorized_keys2` ::

source: Break-off the snapmirror resource.
fr: Arrêt de la synchronisation d'une ressource snapmirror

source: Check that target toaster hostname in present in the file
fr: Vérifier que le nom d'hôte de la cible, toaster, est présent dans le fichier

source: Command set
fr: Commandes

source: Create a role
fr: Créer un rôle

source: Create account
fr: Créer un compte

source: Diskstart in disaster recovery (split) mode
fr: Diskstart en situation de plan de reprise d'activité (split mode)

source: Diskstart in multi-site cluster (swap) mode
fr: Diskstart en situation de cluster multi-sites (swap mode)

source: Examples
fr: Exemples

source: Force flag
fr: Paramètre de forçage

source: If the ssh setup has already been done skip the following command. Run secureadmin status to check.
fr: Si la configuration ssh a déjà été réalisée, sauter la commande suivante. La commande secureadmin peut être lancée pour vérifier la configuration actuelle.

source: Key-based ssh access to the filers. The root account's key-pair is used by OpenSVC. The filer account used is settable in the service configuration file. The filer account must have snapmirror handling capabilities granted. Cluster mode
fr: Accès par clé ssh aux têtes de stockage. La paire de clés du compte root est utilisée par OpenSVC. La compte utilisé sur la tête de stockage peut être paramétré dans le fichier de configuration du service. Il doit avoir les habilitations pour utiliser snapmirror.

source: Netapp user account setup
fr: Configuration du compte Netapp

source: On Source toaster : Ensure target toaster is trusted
fr: Sur le toaster source : s'assurer que la cible toaster est autorisée

source: On Target toaster : Fill in the /etc/snapmirror.conf to specify the snapmirror policy
fr: Sur le toaster cible: renseigner le fichier /etc/snapmirror.conf pour qu'il définisse la politique snapmirror

source: On Target toaster : Initialize snapmirror replication
fr: Sur le toaster cible : initialiser la replication snapmirror

source: On Target toaster : Restrict destination volume
fr: Sur le toaster cible : restreindre au volume cible

source: OpenSVC does not provide assistance in initial snapmirror configuration. The necessary steps are described below to help you kickstart a service setup. OpenSVC declines liability for your breaking your filers. For accurate information please refer to Netapp documentations.
fr: OpenSVC n'assiste pas à l'initialisation du snapmirror. Les étapes nécessaires sont décrites ci-bas pour aider à démarrer la configuration d'un service. OpenSVC décline toute responsabilité en cas de corruption de vos données. Pour une documentation exhaustive sur le sujet, vous êtes encouragés à vous réferrer aux à la base documentaire de Netapp.

source: Pre-requisites
fr: Pré-requis

source: Quiesce a replication
fr: Mise en pause d'une réplication

source: Re-establish the snapmirror synchronization using current destination as new source.
fr: Rétablit la synchronisation snapmirror en utilisant la cible actuelle en tant que nouvelle source.

source: Re-establish the snapmirror synchronization.
fr: Déclenche une resynchronisation snapmirror.

source: Resume a replication
fr: Rétablissement d'une réplication en pause

source: Resume snapmirror sync schedule (rollbacks the effect of quiesce).
fr: Restaure la planification de synchronisation du snapmirror (annule les effets de quiesce).

source: Resync a replication
fr: Resynchronisation de la ressource

source: Service configuration file
fr: Fichier de configuration du service

source: Service configuration for Netapp
fr: Configuration d'un service pour Netapp

source: Setup ssh key-based authentication
fr: Configuration de l'autentification par clé ssh

source: Snapmirror configuration
fr: Configuration snapmirror

source: Split a replication
fr: Arrêt de la réplication

source: Status
fr: Etats

source: The --force flag is honored by the 'start' command only. It disables the exit on quiesce failure in the 'quiesce -> break' sequence. Be aware it means that the service will take over with a lagged data cursor.
fr: Le paramètre --force est pris en compte par la commande 'start' uniquement. Il inhibe l'interruption sur échec de la séquence 'quiesce -> break'. Attention, cela signifie que le service va être démarré avec le dernier jeu de données reçu.

source: The mode is deduced from the node's host mode (:file:`/opt/opensvc/var/host_mode`) : a PRD host mode implies the swap sync mode, otherwise the split sync mode is selected.
fr: Le mode est déduit du 'host mode' du noeud (:file:`/opt/opensvc/var/host_mode`) : un host_mode à PRD implique que le sens de synchronisation sera inversé (swap mode), autrement la réplication sera arrêtée (split mode).

source: The scheduling is disabled because syncs are drived by OpenSVC and that both replication directions are provisionned for swaps (one of them will appear as 'Uninitialized' in status).
fr: La planification est désactivée car les synchronisations sont prises en charge par OpenSVC et que les deux sens de réplications sont configurés pour les cas d'inversion de sens de réplication (l'un d'entre eux apparaîtra 'Uninitialized' dans les états).

source: The snapmirror are in one of the following state: * transfer is in progress * lag is beyond sync_max_delay
fr: Les snapmirrors peuvent être dans l'un des états suivant : * transfert en cours * retard au-delà de sync_max_delay

source: The snapmirror are operational and the lag in under sync_max_delay
fr: Les snapmirror sont opérationnels et le retard est en-dessous de sync_max_delay

source: This is the default disaster recovery mode. Upon service startup on a DRP node, the snapmirrored resources are quiesced if the master filer is still joinable, then broken-off. The DRP node data cursor on the broken-off resources is considered volatile (still can be manually synchronized to the primary filer before failback to production node).
fr: C'est le mode par défaut de plan de reprise d'activité. En cas d'activation du service sur un noeud de DRP, les ressources snapmirror sont mises en pause si la tête de stockage maître est encore joignable, puis arrêtées. Les données écrites sur les disques répliqués durant un PRA sont considérées volatiles (bien qu'elle puissent être synchronisées vers la tête de stockage primaire par des commandes manuelles avant la procédure de retour des services sur les noeuds de production).

source: This mode is dedicated to multi-site clusters. Upon service startup on a secondary node, the snapmirrored are quiesced and sync directions are swapped to set the 'source' to the filer local to the secondary node taking over the service.
fr: Ce mode est dédié aux clusters multi-sites. En cas l'activation du service sur un noeud secondaire, les ressources snapmirror sont mis en pause et leur sens de réplication est inversé pour que la 'source' soit tenue par la tête de stockage en affinité de localisation avec le noeud qui prend le service.

source: Trigger a snapmirror sync.
fr: Déclenche une synchronisation snapmirror.

source: Trigger an ultimate snapmirror sync then suspend the resync scheduling.
fr: Déclenche une ultime réplication snapmirror puis suspend la planification de resynchronisation

source: Trust all PRD nodes root public keys on all filers. Trust DRP nodes root public keys only on their local filer.
fr: Autoriser toutes les clés des comptes root des noeuds de PRD sur toutes les têtes de stockage. Autorise les clés de comptes root des noeuds de DRP seulement sur leur tête de stockage en affinité de localisation.

source: Trust keys
fr: Autorisation des clés

source: noop
fr: sans effet

source: resource is not in snapmirrored state
fr: la ressource n'est pas en état snapmirrored

source: slave filer is unreachable
fr: la tête de stockage esclave n'est pas joignable
