Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/storage.symclone.po
Languages: fr

source: A service with only symclone sync resource can be defined to drive the clone of other servers, just for the benefit of centralised logging and scheduling.
fr: Il est possible de créer un service contenant uniquement une ressource de synchronisation symclone afin de piloter les rafraîchissements du clone consommé par d'autres serveurs, juste pour le bénéfice de la centralisation des journaux et pour la planification.

source: Activate the resource devices, breaking the data-replication. The source starts to log differences. The devices are promoted to read-write access.
fr: Active les devices de la ressource, casse les réplications de données. La source commence alors à journaliser les différences. L'accès aux devices est promu en lecture-écriture.

source: Add source devices to the group
fr: Ajouter les devices source au groupe

source: Add target devices to the group
fr: Ajouter les devices cible au groupe

source: Command set
fr: Commandes

source: Create a symmetrix disk group
fr: Créer un groupe de disques Symmetrix

source: Device are in a unexpected state or not present in the resource symmetrix disk group.
fr: Les devices sont dans un état non prévu ou non présent dans le groupe de disques Symmetrix.

source: EMC Symmetrix arrays clones allow multi-target block device replication, splitting a set of cloned devices, resyncing and merging changes on a clone set to its source set. After the initial full copy, all resyncs are delta-based. These excellent features allow opensvc to drive services using a cloned device set, handling the splitting on start-up and providing a simple command for resync and merge-back. This kind of services are often used for maintenance, pre-production, performance testing environments, where the source device set is used for production. The following documentation presents the configuration of such a service.
fr: Les clones des baies de stockage EMC Symmetrix permettent d'entretenir la réplication des changements des disques source vers plusieurs jeux de disques cibles, de casser la réplication vers un jeu de disques, de resynchroniser ou de fusionner les changements réalisés sur un clone vers son jeu de disque source. Après une copie complète initiale, toutes les resynchronisation sont faite de façon incrémentale. Ces excellentes fonctionnalités permettent à OpenSVC de gérer des services bâtis sur des disques clonés, auquel cas il gère la rupture de synchronisation au démarrage du service et propose une commande simple de resynchronisation ou de fusion vers la source. Ce type de services est souvent utilisé pour les rôles de maintenance, pré-production et tests de performance où les disques sources sont utilisés en production. La présente documentation présente comment configurer un tel service.

source: Examples
fr: Exemples

source: Pre-requisites
fr: Pré-requis

source: Re-establish the resource devices replication. This command verifies the service is down before proceeding.
fr: Rétablir la synchronisation depuis les disques source. Cette commande vérifie que le service est arrêté au préalable.

source: Resync service clones
fr: Resynchronisation des clone du service

source: Service configuration
fr: Configuration du service

source: Service configuration file
fr: Fichier de configuration du service

source: Start a service using clones
fr: Démarrer un service qui utilise des clones

source: Start the initial copy
fr: Démarrer la copie initiale

source: Status
fr: Etats

source: Symmetrix clone configuration
fr: Configuration des clones Symmetrix

source: Symmetrix clones
fr: Clones Symmetrix

source: The last replication occured less than 'sync_max_delay' minutes ago.
fr: La dernière réplication a eu lieu il y a moins de 'sync_max_delay' minutes

source: The last replication occured more than 'sync_max_delay' minutes ago.
fr: La dernière réplication a eu lieu il y a plus de 'sync_max_delay' minutes

source: The symcli commands must be installed in the standard location on the nodes running this service resource type.
fr: Les commandes symcli doivent être installées à leur emplacement standard sur les noeuds gestionnaires de ce type de ressources.

source: You can setup as many sync resources as needed to ensure a consistent replication scenario. For example, you might want to clone an Oracle database data first, then in a subsequent sync, clone the archivelogs.
fr: Il est possible de définir autant de ressources de synchronisation que nécessaire pour assurer un scénario de réplication consistent. Par exemple, il possible de cloner dans une première étape les données d'une base de données Oracle, puis de cloner lors d'une synchronisation suivante les archivelogs de cette base.
