Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/storage.evasnap.po
Languages: fr

source: A service with only evasnap sync resources can be defined to drive the snapshots of other servers, just for the benefit of centralised logging and scheduling.
fr: Il est possible de créer un service contenant uniquement une ressource de synchronisation evasnap afin de piloter les rafraîchissements des snapshots consommés par d'autres serveurs, juste pour le bénéfice de la centralisation des journaux et pour la planification.

source: A snapshot does not exist.
fr: A des snapshots n'existe pas.

source: A snapshot exist but with incorrect origin.
fr: Un des snapshots existe mais avec une origine incorrecte.

source: A snapshot exist but with incorrect presentation (host or lunid).
fr: Un snapshot existe mais avec une présentation incorrecte (mauvais lun id ou mauvais hôte)

source: Bypass the sync_min_delay protection.
fr: Outre-passer la protection du sync_min_delay

source: Command set
fr: Commandes

source: Delete Logical Units and snapshots, then create new snapshots and present them.
fr: Supprime les unités logiques et les snapshots, puis les recrée et les présente.

source: EVA snapshots configuration
fr: Configuration des snapshots EVA

source: Examples
fr: Exemples

source: HP StorageWorks EVA snapshots
fr: Snapshots HP StorageWorks EVA

source: Incorrect credentials for the manager.
fr: Accréditions sur le gestionnaire incorrectes.

source: Missing sssu binary.
fr: Binaire sssu absent.

source: Missing sssu.conf configuration file.
fr: Fichier de configuration sssu.conf absent.

source: Pre-requisites
fr: Pré-requis

source: Resync a started service snapshots
fr: Resynchronise les snapshots d'un service démarré

source: Resync a stopped service snapshots
fr: Resynchronise les snapshots d'un service arrêté

source: Service configuration
fr: Configuration du service

source: Service configuration file
fr: Fichier de configuration du service

source: Status
fr: Etats

source: The EVA arrays snapshots driver allow multi-target block device replication and support the 'syncresync' action which automates the snapshot recreation and presentation to hosts. An opensvc service can thus easily use a snapshoted set of devices. This kind of services are often used for maintenance, pre-production, performance testing environments, where the source device set is used for production. The following documentation presents the configuration of such a service.
fr: Le pilote des snapshots des baies de stockage EVA permet de répliquer une source vers plusieurs cibles. Il supporte l'action 'syncresync' qui automatise la recréation des snapshots et leur présentation aux noeuds. Un service OpenSVC peut facilement utiliser un jeu de devices snapshottés. Ce type de services est souvent utilisé pour les rôles de maintenance, pré-production et tests de performance où les disques sources sont utilisés en production. La présente documentation présente comment configurer un tel service.

source: The array is not managed by the specified manager.
fr: La baie de stockage n'est pas gérée par le gestionnaire spécifié.

source: The last resync occured less than 'sync_max_delay' minutes ago.
fr: La dernière réplication a eu lieu il y a moins de 'sync_max_delay' minutes

source: The last resync occured more than 'sync_max_delay' minutes ago.
fr: La dernière réplication a eu lieu il y a plus de 'sync_max_delay' minutes

source: The sssu binary must be installed on the node and symlinked from /opt/opensvc/bin/sssu. An /opt/opensvc/etc/sssu.conf must exist and contain credentials to access the Command View manager for each array. This sssu.conf file permissions should be 600 and owned by root. OpenSVC takes care of obfuscating the password in the output, local logs, and logs sent to the collector.
fr: Le binaire sssu doit être installé sur le noeud et un lien symbolique /opt/opensvc/bin/sssu doit le pointer. Un fichier /opt/opensvc/etc/sssu.conf doit exister et contenir les informations d'autentification auprès du gestionnaire Command View pour chaque baie. Ce fichier de configuration de sssu doit avoir ses permissions positionnées à 600 et être propriété de root. OpenSVC se charge d'obfusquer le mot de passe dans les sorties et dans les journaux envoyés au collecteur.

source: You can setup as many sync resources as needed to ensure a consistent replication scenario.
fr: Il est possible de définir autant de ressources de synchronisation que nécessaire pour assurer un scénario de réplication consistent.

source: You have to create the snapshots manually once and present them to thes hosts, so that the EVA array attributes new snapshots wwid and logical unit numbers. Theses properties can then be set in the service env file to ensure the snapshots will always be created and presented using those same properties. This is important to make the snapshot resync as transparent as possible to the operating system, and not to trigger device renames.
fr: Il est nécessaire de créer les snapshots manuellement la première fois et de les présenter aux noeuds, afin que la baie attribue aux nouveaux snapshots leur wwid et leur numéro de lun. Ces propriétés seront ensuite renseignées dans le fichier de configuration du service pour assurer que les snapshots auront toujours ces mêmes propriétés. Il est important pour certains systèmes d'exploitation de rendre le rafraîchissement des snapshots aussi transparent que possible pour ne pas provoquer le renommage des devices.
