Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/storage.dds.po
Languages: fr

source: After succesful delta application on targets, snap1 is removed and snap2 is renamed snap1. Ready for the next incremental sync.
fr: Après application réussie du delta sur les cibles, snap1 est supprimé et snap2 est renommé snap1. Tout est près pour la synchronisation incrémentale suivante.

source: Cluster mode
fr: Mode cluster

source: Command set
fr: Commandes

source: Delta generation
fr: Génération du delta

source: Examples
fr: Exemples

source: Full synchronization
fr: Synchronisation complète

source: In other words, the binary delta file contains all data changed between snap1 and snap2 creation times, plus the mapping table keeping track of each chunk offset in the origin.
fr: Autrement dit, le delta binaire contient toutes les données changées entre la création de snap1 et de snap2, plus la table des pointeurs qui stocke les offsets des chunks sur l'origine.

source: Incremental synchronization
fr: Synchronisation incrémentale

source: Incremental synchronization. dds-based. Extract the binary delta as a file, send to file to the target systems and replay the changes there.
fr: Synchronisation incrémentale. Basée sur dds. Extrait un delta binaire sous forme de fichier, envoie ce fichier sur les noeuds cibles et y rejoue les changements.

source: Initial synchronization. dd-based. Make the whole dataset transit on the wire. Also needed when source and target get out-of-sync. This operation, though a storage bandwidth drain, works on a snapshot, so the service need not be down.
fr: Synchronisation initiale. Basée sur dds. Fait transiter toutes les données sur le réseau. Egalement nécessaire lorsque la source et la cible sont dé-synchronisées. Cette opération, bien que consommatrice en bande passante, utilise un snapshot donc le service n'a pas besoin d'être arrêté.

source: Last synchronization occured less than sync_max_delay minutes ago.
fr: La dernière réplication a eu lieu il y a moins de 'sync_max_delay' minutes

source: Last synchronization occured more than sync_max_delay minutes ago.
fr: La dernière réplication a eu lieu il y a plus de 'sync_max_delay' minutes

source: Service configuration
fr: Configuration du service

source: Service configuration file
fr: Fichier de configuration du service

source: Source and targets maintain a state file to identify the last incremental synchronization done properly. This state is used to check that the deltas application sequence is not broken. If broken, alerts are emited and a full sync must be scheduled.
fr: La source et les cibles maintiennent un fichier d'état pour stocker l'horodatage de la dernière synchronisation incrémentale réussie. Cette information est utilisée pour vérifier que la séquence d'application des delta n'a pas été interrompue. Si elle l'a été, une alerte est émise et une synchronisation complète devient nécessaire.

source: Status
fr: Etats

source: The dds replication scheme is like ddsnap, just simpler, dumber and entirely in userspace. It builds around the dds utility, provided by OpenSVC and available from the OpenSVC repositories. This tool parses the LVM2 snapshots copy-on-write table to identify changed chunks since snapshot creation and gather fresh data from the origin or from a newer snapshot of the same origin. OpenSVC uses this low-level feature-set to implement binary-delta incremental logical volume replication.
fr: Le mécanisme de réplication par dds est similaire à ddsnap, en plus simple, plus spécifique, et complètement userspace. Il repose sur l'outil dds, mis à disposition par OpenSVC via http://repo.opensvc.com. Cet outil consulte les tables de copy-on-write des snapshots LVM2 à la recherche des segments de données changés depuis la création du snapshot et rassemble les dernières données depuis l'origine du snapshot ou depuis un snapshot plus récent de la même origine. OpenSVC utilise ces fonctions bas-niveau pour implémenter un mécanisme de réplication de volumes logiques par envois incrémentaux de deltas binaires.

source: This is the default disaster recovery mode. Upon service startup on a DRP node, the dds replication is blocked from the DRP node. The return to production mode usually involves a full resynchronization.
fr: C'est le mode par défaut de plan de reprise d'activité. Lors du démarrage d'un service sur un noeud DRP, la réplication dds est suspendue à l'initiative du noeud DRP. Le retour au mode de production normal implique dans le cas général une synchronisation complète.

source: dds data replication
fr: Réplication de données par dds

source: dds reads the snap1 (oldest) snapshot cow table. For each changed chunk, fetch chunk data from snap2. In the diagram, chunk1 has not changed since snap2 creation, so data is actually read from origin, whereas chunk4 has changed since snap2 creation, so data is read from snap2 cow segment.
fr: dds lit la table de copy-on-write du snap1 (le plus agé). Pour chaque chunk changé, il récupère les données du chunk depuis snap2. Dans le diagramme, chunk1 n'a pas changé depsui la création de snap2, donc ses données sont lues depuis l'origine. chunk4, lui, a changé depuis la création de snap2, donc ses données sont lues depuis la table cow de snap2.
