Repository: cgalibern/docs.opensvc.com
Catalog: source/translated/*/virtualization.ovm.po
Languages: fr

source: Add the authentication information to /opt/opensvc/etc/auth.conf (check that this file is not world-readable)::
fr: Ajouter les informations d'autentification au fichier /opt/opensvc/etc/auth.conf (vérifier que ce fichier n'est pas lisible par tous) ::

source: Examples
fr: Exemples

source: For reference, Oracle Linux public repositories are available at http://public-yum.oracle.com/public-yum-ovm2.repo
fr: Pour mémoire, les dépôts publiques de Oracle Linux sont disponibles à http://public-yum.oracle.com/public-yum-ovm2.repo

source: HA enabled or disabled
fr: HA activé ou désactivé

source: Install ovmcli
fr: Installer ovmcli

source: Make sure you set up the following repositories in ``/etc/yum.conf`` or ``/etc/yum.repo.d/``::
fr: Assurez-vous de paramétrer les dépôts suivants dans ``/etc/yum.conf`` ou ``/etc/yum.repo.d/`` ::

source: Migrate a OVM service
fr: Migrer un service OVM

source: OVM server configuration
fr: Configuration d'un serveur OVM

source: OpenSVC node configuration
fr: Configuration OpenSVC du noeud

source: Oracle has a unique value proposition with OVM:
fr: Oracle dispose d'une offre originale avec OVM :

source: Oracle provides downloadable OVM server installation media and manager installation archives through its E-delivery website.
fr: Oracle propose au téléchargement les média d'installation des serveurs OVM et du gestionnaire à travers le site E-delivery.

source: Oracle provides tuned and easily instanciable VM templates for those products
fr: Oracle met à disposition des images de machine virtuelle facilement instanciables avec ses produits applicatifs pré-installés.

source: Oracle's products are certified on OVM (Oracle Linux, Solaris, database, PeopleSoft, middleware, ...)
fr: Les produits applicatifs d'Oracle sont certifiés sur OVM (Oracle Linux, Solaris, base de données, middleware, ...)

source: Service configuration
fr: Configuration du service

source: Start a OVM service
fr: Démarrage d'un service OVM

source: Stop a OVM service
fr: Arrêt d'un service OVM

source: The OVM servers need to be able to communicate with their manager for OpenSVC to handle service HA flag. This communication uses the ovmcli tool provided by Oracle.
fr: Les serveurs OVM doivent pourvoir communiquer avec le gestionnaire afin qu'OpenSVC puisse prendre en charge la fonctionnalité HA. Cette communication utilise l'outil ovmcli fourni par Oracle.

source: The OpenSVC driver for OVM supports:
fr: Le pilote OpenSVC pour OVM supporte :

source: The Oracle VM infrastructure is based on the Xen virtualization technology and Oracle own clusterware. VM images are stored as files in either a network filesystem or Oracle's cluster filesystem (OCFS2). Hypervisors are called OVM servers. A OVM manager is mandatory to create OVM server pools and to configure per-VM failover policy.
fr: L'infrastructure OVM est basée sur la technologie de virtualisation Xen et sur le gestionnaire de cluster d'Oracle. Les images de machine virtuelle sont stockées sous forme de fichiers sur un système de fichier réseau (NFS) ou sur le système de fichier cluster d'Oracle (OCFS2). Les hyperviseurs sont appelés serveurs OVM. Un gestionnaire OVM est nécessaire pour créer les grappes de serveurs OVM et pour configurer les politiques de reprise des VM.

source: The hb resource instruct OpenSVC that the virtual machine must have HA enabled. In this case, manual commands on the service must be submitted using svcmgr --cluster. OpenSVC will disable HA on stop and enable HA on start.
fr: La ressource hb indique à OpenSVC que la machine virtuelle est configurée avec la haute disponibilité activée. Dans ce cas, les commandes manuelles sur le service doivent être passées avec le paramètre --cluster. OpenSVC désactivera HA lors des arrêts de service et le réactivera au démarrage.

source: Then you can install ovmcli with::
fr: Vous pouvez ensuite install ovmcli avec ::

source: You have to run the :command:`ovm config` command one time. You will then be prompted for the manager's access information::
fr: Il est nécessaire de passer au moins une fois la commande :command:`ovm config`. Cette commande sollicite interactivement la saisie du compte utilisateur du gestionnaire et son mot de passe ::

source: ovmcli configuration
fr: configuration d'ovmcli

source: start, stop, migrate of virtual machines
fr: démarrage, arrêt, migration des machines virtuelles

source: the billing is based on support
fr: seul le support est facturé
